[
{
id: "4c672e7a-b23e-11e8-8df5-71dc24a47997",
created_at: "Fri Sep 07 01:37:32 UTC 2018",
title: "Senior Python Developer",
location: "Remote",
type: "Full Time",
description: "<p><strong>Job Title</strong></p> <ul> <li>Senior Python Developer </li> </ul><p><strong>Job Description</strong></p> <ul> <li>Create and maintain Python, Django, Postgres, HTML/JavaScript software stack that executes in an AWS Linux environment. You will have many opportunities to work on new features and put your own mark on our niche advertising technology system.</li> <li>We are looking for experienced developers who are not afraid to get down and dirty with large volumes of code.</li> </ul><p><strong>Job Skills (from most wanted to "would be nice"):</strong></p> <ul> <li>Python (required, with proven track record)</li> <li>Linux/U*ix (required, at least basic admin and shell skills)</li> <li>Django (at least some usage/familiarity)</li> <li>AWS (would be extremely helpful)</li> <li>SQL/Postgres/SQLite</li> <li>HTML/CSS/JavaScript/jQuery</li> </ul><p><strong>Requirements</strong></p> <ul> <li>Self-starter.</li> <li>Have the ability to read lots of Python code and understand what system is doing.</li> <li>This is a small team. We're here to help but you will need to be able to dig through code and learn on your own.</li> <li>Most employees work from home, be sure that you can be productive in that environment.</li> <li>Track record of serious software development</li> <li>Bachelors in comp sci, comp engineering, or if not, extensive coding experience</li> </ul><p><strong>Other</strong></p> <ul> <li>No Agencies Please</li> <li><strong>We are looking for a long term candidate.</strong></li> </ul><p><strong>About the Company</strong></p> <ul> <li>VersaFeed parses massive inventory product feeds from many of the world’s largest merchants. We use Python to ingest product info from CSV/XML/API/DB/web-crawling then we clean, optimize, and finally sync the data out to sites like Google, Facebook, Bing, and may other platforms.</li> <li>We are very stable company with a solid track record and 13 year history. You can see a sampling of our current clients here: <a href="https://www.versafeed.com/about/#testimonials">https://www.versafeed.com/about/#testimonials</a> </li> </ul><p><strong>Benefits</strong> </p> <ul> <li>Work from home if desired</li> <li>High compensation packages including health care, 401k, stock options, etc.</li> <li>Not a daily grind kind-of-job. </li> <li>Small dedicated team, no VC money, </li> <li>Almost all staff is engineering/comp-sci</li> </ul><p><strong>Please include salary requirements and up to date resume</strong>. Thank you for your consideration.</p>",
how_to_apply: "<p><a href="mailto:jobs+gh@versafeed.com">jobs+gh@versafeed.com</a></p>",
company: "VersaFeed",
company_url: "http://www.versafeed.com",
company_logo: "http://github-jobs.s3.amazonaws.com/11b37d42-b23e-11e8-98c4-84829baec2dd.jpg",
url: "http://jobs.github.com/positions/4c672e7a-b23e-11e8-8df5-71dc24a47997"
},
{
id: "bbb041a8-b1e5-11e8-9313-b0b634cec7c7",
created_at: "Thu Sep 06 15:03:07 UTC 2018",
title: "Senior Frontend Engineer",
location: "San Francisco or Remote",
type: "Full Time",
description: "<p>We're looking for a Senior Frontend Engineer to help design and build the applications and services to support the Make School platform. We view software as the backbone of our classrooms and are working to digitize our entire curriculum to build a better learning experience and to allow instructors to focus on providing better in-person support to our students. You'll be responsible for our Online Academy, student management system, portfolios, the marketing website, reporting, and other Make School needs.</p> <h2>Our Stack:</h2> <p>React, Relay, GraphQL, Redux, ES6, Webpack, Jest, Ruby on Rails (marketing site)</p> <h2>Our Process:</h2> <p>We are an agile team that follows a scrum methodology using Asana. We have stand-ups, sprint planning meetings, retrospectives and pair programming sessions. We connect regularly over Slack &amp; video chat and look forward to seeing your face there!</p> <h2>Location:</h2> <p>This position can be remote (US-friendly time zones) or based in our headquarters in San Francisco.</p> <h1>What You’ll Do:</h1> <ul> <li>Play a key role in the continued architecture and implementation of the Make School educational platform</li> <li>Analyze and improve the efficiency and reliability of the Make School infrastructure</li> <li>Write code with best-practices (including TDD) and participate in peer code review</li> <li>Create the best user experience (for internal &amp; external users)</li> </ul><h1>What We’re Looking For:</h1> <ul> <li>4+ years of strong development experience in our stack, especially React/Relay/GraphQL</li> <li>Debugging, quality-assurance and performance analysis experience</li> <li>Ability to work well with both in-person and remote peers</li> <li>Strong understanding of TDD and ES6 best practices</li> <li>Ability to accurately set timelines and to clearly define specifications</li> <li>Ability to work efficiently and manage trade-offs when faced with conflicting deadlines</li> <li>Ability to clearly communicate thought process</li> <li>Ability and confidence to take ownership of projects</li> <li>A strong understanding of visual design and user experience principles</li> <li>Passion for education</li> <li>Bonus points for experience with Ruby on Rails</li> </ul><h2>About Make School</h2> <p>Make School is an accelerated college program for students who want a hands-on and product-oriented educational experience. The program spans two years, divided by a six-month internship at a tech startup. Students learn the Computer Science theory covered by traditional universities paired with the practical experience of building and shipping products, plus soft skills such as ethics, storytelling, and interpersonal communication. Students network with successful founders and developers throughout the program, and are placed at a tech startup upon graduating. The program has no up front cost, and instead students pay tuition through internship and post-grad job earnings.</p> <p>We also run a six week Summer Academy program teaching iOS and web development, and our online curriculum inspires thousands of people to become software engineers.</p>",
how_to_apply: "<p>Fill out this form here <a href="https://jobs.lever.co/makeschool/1edb94b9-0757-4f2f-a0bb-9cb795778699/apply">https://jobs.lever.co/makeschool/1edb94b9-0757-4f2f-a0bb-9cb795778699/apply</a> and attach your resume to apply.</p>",
company: "Make School",
company_url: "https://www.makeschool.com/",
company_logo: "http://github-jobs.s3.amazonaws.com/b46a15cc-b1e5-11e8-8989-d280facb938d.png",
url: "http://jobs.github.com/positions/bbb041a8-b1e5-11e8-9313-b0b634cec7c7"
},
{
id: "5072ebfa-b1dd-11e8-8029-f2d1786f7a93",
created_at: "Thu Sep 06 14:05:10 UTC 2018",
title: "Smartphone Camera and Image Editing App Developer",
location: "Flexible",
type: "Full Time",
description: "<p>We are a startup based in NYC working on cutting edge camera and image editing functionality for smartphones focused on the real estate industry. We are seeking programmers with great familiarity with camera and auto-editing functionality and interest in innovating in this area. We are flexible on hourly or full-time work engagements and telecommuting.</p>",
how_to_apply: "<p><a href="mailto:guysha@protonmail.com">guysha@protonmail.com</a></p>",
company: "Camera App Startup",
company_url: null,
company_logo: null,
url: "http://jobs.github.com/positions/5072ebfa-b1dd-11e8-8029-f2d1786f7a93"
},
{
id: "3734409a-b1d7-11e8-9b94-c74fbabb8704",
created_at: "Thu Sep 06 13:18:15 UTC 2018",
title: "Senior Algorithm Software Developer",
location: "Santa Clara, CA",
type: "Full Time",
description: "<p>Job Description Agilent inspires and supports discoveries that advance the quality of life. We provide life science, diagnostic and applied market laboratories worldwide with instruments, services, consumables, applications and expertise. Agilent enables customers to gain the answers and insights they seek ---- so they can do what they do best: improve the world around us. Information about Agilent is available at <a href="http://www.agilent.com">www.agilent.com</a>.</p> <p>Join our team of inventors, scientists, engineers and visionaries to create software that is used to analyze the data of life! Be part of our team, developing world-class data analysis and informatics software that enables our customers to find solutions ranging from discovery of cancer biomarkers to finding pesticides in food. You will be designing and implementing algorithms and components that allow our software to match our customers' workflows with seamless user experiences (UX) and support their analysis, evaluation and visualization of complex data. </p> <p>As a highly motivated individual, you will engage in the following:</p> <ul> <li>Develop and implement new algorithms and enhance existing algorithms that are used across multiple applications to do biochemical analysis of mass spec data.</li> <li>Inventing and re-engineering software algorithms for improved data analysis and software components for meaningful visualization of those complex data sets. </li> <li>Interacting with internal scientists and external customers to better understand their algorithm and visualization needs</li> <li>Providing leadership in evaluating new and emerging analysis technologies </li> <li>Participate in engineering discussions with other engineers to advance our analysis capabilities</li> </ul><p>Requirements</p> <ul> <li>M.S. or Ph.D. in computer science or related field with at least 8 years experience as software engineer; or combination of education and experience</li> <li>Experience with large data processing algorithms, numerical analysis, software design patterns and data structures</li> <li>Strong design and programming skills (C#, C++ preferred)</li> </ul><p>Additional preferred skills:</p> <ul> <li>Digital signal process experience</li> <li>Microsoft .NET and WPF programming experience</li> <li>Machine learning knowledge and experience</li> <li>UI and UX design and development for complex data</li> <li>Life sciences knowledge (e.g. college level biochemistry)</li> <li>Mass spectrometry data analysis experience</li> <li>Experience working in an Agile SCRUM product development environment</li> <li>Solid verbal and written communication skills</li> <li>Team player that works well with a diverse collaborative team including scientist and engineers from a variety of disciplines</li> <li>Inquisitive, likes to ask questions and delve into the new and unknown to provide best possible solutions Agilent Technologies, Inc. is an Equal Employment Opportunity and Affirmative Action employer. We value diversity at all levels. All individuals, regardless of personal characteristics, are encouraged to apply. All qualified applicants will receive consideration for employment without regard to sex, pregnancy, race, religion or religious creed, color, gender, gender identity, gender expression, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital status, registered domestic partner status, age, sexual orientation, military or veteran status, protected veteran status, or any other basis protected by federal, state, local law, ordinance, or regulation and will not be discriminated against on these bases.</li> </ul>",
how_to_apply: "<p>Please click here to apply: <a href="https://recruiting.adp.com/srccar/public/RTI.home?c=2167807&amp;d=External&amp;r=5000354052006#/">https://recruiting.adp.com/srccar/public/RTI.home?c=2167807&amp;d=External&amp;r=5000354052006#/</a></p>",
company: "Agilent",
company_url: null,
company_logo: null,
url: "http://jobs.github.com/positions/3734409a-b1d7-11e8-9b94-c74fbabb8704"
},
{
id: "b2417f72-99a0-11e8-9e2b-c53fb90d38df",
created_at: "Thu Sep 06 10:18:31 UTC 2018",
title: "Senior full-stack software engineer - JS + Ruby",
location: "Remote",
type: "Full Time",
description: "<p>We created Sticker Mule to be the best place to work and shop. That means making ordering fast, simple and fun while creating a stable, low stress and enjoyable place for talented people to work.<br></p> <p>We're searching for more to join us as we look to build one of the Internet's best technical teams. Some of our current projects include migrating to a service architecture, inter-service communication with GCloud PubSub and GRPC, API Gateway based GraphQL, event sourcing persistence and CQRS, and manufacturing and artwork processing automation.<br></p> <p><a href="https://www.stickermule.com/about">Watch a brief video to learn more</a></p> <p><strong>Why we enjoy working here</strong><br> 1. We work flexible hours with an asynchronous culture. <br> 2. We work at a sustainable pace without unreasonable external deadlines.<br> 3. Varied, interesting technical challenges to work on.<br> 4. Opportunities to make a large impact as part of a small, highly motivated team.<br></p> <p><strong>Our tech stack</strong><br> 1. Backend: Ruby on Rails, NodeJS, Go<br> 2. DB: Aurora/Mysql, Postgres, Redis<br> 3. Frontend: React, Redux, Webpack<br> 4. APIS: GraphQL, GRPC, GCloud PubSub<br> 5. AWS, migrating to Gcloud<br> 6. Docker, Kubernetes<br></p> <p><strong>What you will do</strong><br> 1. Design, build, test, deploy and maintain web applications and services<br> 2. Write clean, performant code in accordance with our team’s code style guidelines<br> 3. Work to improve and maintain the code health of all our software<br> 4. Collaborate with team leads and stakeholders to ensure that we’re always building the best possible solution in the optimal way<br> 5. Participate in peer code reviewsShare expertise with other members of the team, mentor junior developers<br></p> <p><strong>About you</strong><br> 1. You have a minimum of 3 years professional software development experience<br> 2. You’re highly competent in JavaScript and have some experience with Ruby<br> 3. You have experience building single page applications, ideally with with React<br> 4. You possess strong analytical and critical thinking skills<br> 5. You have great written and verbal communication skills in English<br></p> <p><strong>Requirements</strong><br> 1. Applicants will be sent a Hackerrank test within 1-3 days of applying.<br> 2. Test must be completed within 5 days.<br></p> <p><strong>Compensation</strong><br> 1. $90,000-$115,000+ depending on experience<br> 2. Signing bonus<br> 3. 28 days vacation<br></p>",
how_to_apply: "<p>Apply here only: <a href="https://www.stickermule.com/career/178e2cdf-2e15-47e8-9d32-b24ac89032bf">https://www.stickermule.com/career/178e2cdf-2e15-47e8-9d32-b24ac89032bf</a></p>",
company: "Sticker Mule",
company_url: "https://www.stickermule.com/careers",
company_logo: "http://github-jobs.s3.amazonaws.com/afb549d2-99a0-11e8-8da5-79d387cc135d.png",
url: "http://jobs.github.com/positions/b2417f72-99a0-11e8-9e2b-c53fb90d38df"
},
{
id: "b7a15df4-b131-11e8-8365-9fa4cd09c6bb",
created_at: "Wed Sep 05 17:32:53 UTC 2018",
title: "Sr/Lead Ruby Engineer",
location: "Mountain View, CA, US",
type: "Full Time",
description: "<p></p><p><strong>Sr/Lead Engineer – Ruby/JS, Audience team @ NinthDecimal. </strong></p><p>NinthDecimal continues to advance its position as a leader in the Marketing and Advertising industry. We deliver best-in-class Measurement, Insights and Analytics by deploying advanced data science methodologies on data sets of massive scale. Our new platform (called Location Graph) offers capabilities to create and target custom audience segments at scale. It is based on the history of past and present location data connected and matched to various 3rd party data sources. As a result, the platform can derive in real time (tens of thousands of requests per second) whether an ad request comes from a mom, a student, middle age male who is a business traveler and dozens of other profiles. We deal with 10+ billions of signals from mobile devices every day. The Audience arm of the company is using this data to create and distribute highly targeted custom audiences that help brands reach the right consumers.</p><p>As a Lead Engineer, you will be responsible for delivery of the Audience Product roadmap, evolution of the architecture and leading a small team. You will work closely with other engineers, the Product team, various business units, and other engineering teams. The tools and solutions that Audience team builds drives substantial business with external clients and allows internal teams to automate core business processes. Technology stack used in the Audience team is: Ruby 2.3-2.4 on rails 4.x, CoffeeScript, Sass, Rspec, Capibara, Ransack, Devise, Migrations, jQuery, Bootstrap, mysql, RESTful APIs. The full stack used by this and other engineering teams includes: Kubernetes, Docker, scala/python/java based microservices, Akka, Spark.</p><p><strong>The responsibilities for this position include these activities:</strong></p><ul> <li>Partner with the Product Owner for Audience team to maintain the backlog and spec out stories</li> <li>Participate in Sprint ceremonies</li> <li>Ensure on-time delivery of tickets</li> <li>Conduct and coordinate releases</li> <li>Maintain 85 percent+ code coverage with tests</li> <li>Contribute to and promote good software engineering practices across the Engineering Department</li> <li>Provide leadership in the team working with onsite and offshore engineers</li> </ul><p><strong>Qualifications Required:</strong></p><ul> <li>A true passion for best user experience and employing best engineering practices</li> <li>Being a team player, NinthDecimal is not a good place for genius lone wolfs</li> <li>3+ years’ experience as a Ruby on Rails engineer</li> <li>Experience with full stack and backend technologies and systems</li> <li>Familiarity with the digital media / advertising industry is a big plus</li> </ul><img src="https://www.applytracking.com/track.aspx/7jxEZ">",
how_to_apply: "<p><a href="https://www.applytracking.com/track.aspx/7jxEj">https://www.applytracking.com/track.aspx/7jxEj</a></p>",
company: "NinthDecimal",
company_url: null,
company_logo: null,
url: "http://jobs.github.com/positions/b7a15df4-b131-11e8-8365-9fa4cd09c6bb"
},
{
id: "0e95e6c6-b131-11e8-9101-5d9b8e7f682e",
created_at: "Wed Sep 05 17:28:09 UTC 2018",
title: "Solutions Engineer",
location: "San Francisco, CA, US",
type: "Full Time",
description: "<p></p><p><strong>About NinthDecimal </strong></p><p>NinthDecimal is the leading mobile audience intelligence company empowering marketers with the most comprehensive understanding of people by connecting their digital and physical lives. Fortune 500 companies and marquee brands, including Microsoft, Target, Kraft, Comcast, American Express, Starbucks and Toyota, use NinthDecimal to achieve high performing campaigns by engaging the most precise and relevant audiences across all media channels on a single platform. By bridging online and offline data sources, NinthDecimal offers the most precise audience solution in the market to create a true understanding of mobile consumers and how to engage them throughout their path-to-purchase. Its Location Conversion Index™ (LCI™) is the mobile industry’s most accurate ROI metric for measuring the incremental lift in store visits directly attributed to mobile ad campaigns; and its data partnerships with leading companies like Acxiom, Oracle and Neustar provide a comprehensive closed-loop solution for marketers.</p><p><strong>Summary</strong></p><p>The Solution Engineering role at NinthDecimal requires a love of software development and spending time with clients &amp; partners. This role is for technical individuals who love to build tools and work with clients &amp; partners to realize the full potential of NinthDecimal’s LCI™ Measurement Platform.</p><p>As a Solutions Engineer, you are responsible for developing NinthDecimal technology strategies and solutions to move our measurement platform to the forefront of the industry and executing on those strategies and technologies. You will spend 50 percent of your time working on technical projects. The other 50 percent you will spend working with Account Management Teams, Operations Teams and Partner Technical Teams. This is a client-facing engineering role with a high bar for problem solving and technical skills. This role is located in our San Francisco, CA HQ.</p><p><strong>Responsibilities</strong></p><ul> <li>Split time nearly evenly between hands-on coding and guiding Account Management Teams, Operations Teams and Partner Technical Teams</li> <li>Collaborate with Product &amp; Engineering Teams to build new tools and improve existing ones</li> <li>Write elegant, readable, and well-documented code</li> <li>Deeply understand the business of partners, identify problems or opportunities then address the opportunities using technology</li> <li>Deeply understand NinthDecimal technologies including: <ul> <li>Location Conversion Index™ (LCI™)</li> <li>Location Graph™</li> <li>LCI™ Server-to-Server (S2S) API Endpoints</li> </ul> </li> </ul><p><strong>Requirements</strong></p><ul> <li>At least 1-3 year of experience building software products with clients or partners – Big 4 consulting experience a plus</li> <li>Experience in large and complex code bases</li> <li>Can apply an entrepreneurial approach and passion to problem solving to building solutions</li> <li>B.S. in Computer Science (CS) or equivalent engineering degree (i.e. Computer Engineering, Electrical Engineering, etc.) or proven work experience</li> <li>Excellent communication skills including experience speaking to technical and business audiences and writing technical specifications and articles</li> <li>Experience with Ruby, Python, Bash Shell Scripting, MySQL or other SQL languages</li> <li>Experience with big data platforms such as Hadoop, with Hive or Spark syntax, a big plus</li> </ul><img src="https://www.applytracking.com/track.aspx/7jxCd">",
how_to_apply: "<p><a href="https://www.applytracking.com/track.aspx/7jxCn">https://www.applytracking.com/track.aspx/7jxCn</a></p>",
company: "NinthDecimal",
company_url: null,
company_logo: null,
url: "http://jobs.github.com/positions/0e95e6c6-b131-11e8-9101-5d9b8e7f682e"
},
{
id: "e9791ae8-b130-11e8-9e5c-54330fab55ef",
created_at: "Wed Sep 05 17:27:07 UTC 2018",
title: "Software Engineering - Team Lead",
location: "San Francisco, CA, US",
type: "Full Time",
description: "<p></p><h3><strong>Software Engineering - Team Lead</strong></h3><p>Do you love working in a small, tight-knit company?</p><p>Do you like helping your coworkers grow as people and professionals?</p><p>Do you want to work on hard problems?</p><p>Are you a strong communicator with a penchant for building consensus?</p><p>If any of these strike your fancy, then you might be just the person for a job at iOffer.</p><p> </p><h3><strong>What you'll do</strong></h3><p>As the Team Lead for the Engineering team, you will split your time about 50/50 between coding and performing team lead duties. You'll report directly to the CTO.</p><p><strong>A typical week might include:</strong></p><ul> <li> <p>Writing code and tests for new features or squashing bugs</p> </li> <li> <p>Reviewing code and pull requests</p> </li> <li> <p>Handling the flow of features and bug fixes from dev to production</p> </li> <li> <p>Brainstorming solutions to tricky problems with the team</p> </li> <li> <p>Mentoring other team members</p> </li> <li> <p>Leading engineering team meetings and sprint planning meetings</p> </li> <li> <p>Planning the product roadmap in conjunction with the CTO and other members of the product team</p> </li> <li> <p>Working with the Ops team to ensure the app is reliable, fast, and easy to deploy</p> </li> <li> <p>Participating in the on-call rotation along with the rest of Engineering and Operations</p> </li> </ul><p><strong>Some of the projects you can expect in your first 90 days:</strong></p><ul> <li> <p>Help us determine the skillsets we need to grow the engineering team. </p> </li> <li> <p>Architect and lead the way for a Rails 2.3 -&gt; Rail 5.x migration</p> </li> <li> <p>Clear the backlog of open pull requests for our app</p> </li> </ul><p><strong>We'll be following your lead on what needs done in the app. If you think something needs doing, it will be your job to make the case for it and guide your team on shipping it.</strong></p><h3> <br><strong>You may be a good fit for this role if:</strong> </h3><ul> <li> <p>You are a senior engineer wanting to get your foot in the door into a leadership role while still contributing code regularly.</p> </li> <li> <p>You have experience with Rails, MySQL, and basic frontend development (HTML/CSS/Javascript)</p> </li> <li> <p>You love teamwork and working closely with other people</p> </li> <li> <p>You value simplicity over cleverness in code</p> </li> <li> <p>You value writing tests and consistency with style guides</p> </li> <li> <p>You love teaching and mentoring other engineers</p> </li> <li> <p>Major bonus points if you've ever worked on a major Rails version upgrade project</p> </li> </ul><h3> </h3><h3><strong>About us</strong></h3><p>We are a small-but-growing (and profitable) company of 10 people. We have a flexible schedule and occasional work-from-home days. We love to improve the app regularly for our customers and all suggestions and opinions are both heard and welcomed.</p><h3> </h3><h3><strong>Our stack</strong></h3><ul> <li> <h3>Rails 2.3/Ruby 1.8.7</h3> </li> <li> <p>jQuery 1.8 &amp; 2.0</p> </li> <li> <p>MySQL, Redis, Memcached, Solr, Resque, Sneakers, Sidekiq, RabbitMQ</p> </li> <li> <p>We run the infrastructure on a virtualized platform (VMware) on baremetal.</p> </li> </ul><p> </p><p>Since 2002, iOffer has provided a global online marketplace that connects buyers and sellers all over the world, with over 10M users using iOffer's platform for their eCommerce needs. There are many interesting scale, performance, and architectural projects to tackle.</p><p>We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p><p><strong>Local applicants only (San Francisco, CA) -- no remote. </strong><br><br> </p> <img src="https://www.applytracking.com/track.aspx/7jxCJ">",
how_to_apply: "<p><a href="https://www.applytracking.com/track.aspx/7jxCT">https://www.applytracking.com/track.aspx/7jxCT</a></p>",
company: "iOffer",
company_url: null,
company_logo: null,
url: "http://jobs.github.com/positions/e9791ae8-b130-11e8-9e5c-54330fab55ef"
},
{
id: "9e6dc3a6-b12f-11e8-87af-2d3bfbae9da8",
created_at: "Wed Sep 05 17:18:58 UTC 2018",
title: "Information Security Compliance Analyst",
location: "Baytown, TX",
type: "Full Time",
description: "<p>Information Security Compliance Analyst</p> <p>Posting Number: 0000812</p> <p>Position Status: Full-Time</p> <p>Salary: The starting salary range is $60,000 - $70,000 based on the Lee College Administrative/Administrative Support Salary Scale, C43. Starting salary is commensurate with education and related work experience.</p> <p>Department: Information Technology (IT)</p> <p>Job Summary/Basic Function:</p> <p>The Information Security Compliance Analyst is the designated administrator of the Lee College Information Security Program TAC 202.</p> <p>This position will provide assistance to the Chief Information Officer in the operations of the Lee College Information Security Program, as well as oversight and implementation of system wide information security strategies and solutions. Specific areas include: IT policy, continuity of IT operations, information security risk assessment, information security operations review, and security life cycle for information systems.</p> <p>Duties and responsibilities include, but are not limited to:</p> <ul> <li><p>Develop, recommend, and establish policies, procedures, and practices as necessary to protect Lee College information resources against unauthorized or accidental modification, destruction, or disclosure.</p></li> <li><p>Identify and implement proactive and reactive technical measures to detect vulnerabilities and to defend against external and internal security threats.</p></li> <li><p>Provide consulting and technical support services to owners, custodians, and users in defining and deploying cost-effective security controls and protections.</p></li> <li><p>Establish, maintain, and institutionalize security incident response procedures to ensure that security events are thoroughly investigated, documented, and reported; that damage is minimized, that risks are mitigated, and that remedial actions are taken to prevent recurrence.</p></li> <li><p>Establish and publicize a security awareness program to achieve and maintain a security-conscious user community.</p></li> <li><p>Document, maintain, and obtain ongoing support for all aspects of the information security program.</p></li> <li><p>Monitor the effectiveness of strategies, activities, measures, and controls designed to protect the College information resources.</p></li> <li><p>Assure executive management's awareness of legal and regulatory changes that might impact the College information security and privacy policies and practices.</p></li> <li><p>Serve as Lee College internal and external point of contact for information security matters.</p></li> <li><p>Report frequently (at least annually) on the status and effectiveness of the information security program as directed by the Chief Information Officer (see TAC §202.73(a)).</p></li> <li><p>Have authority for information security for the entire institution (see TAC §202.71(a)(2)).</p></li> <li><p>Develop and recommend policies and establish procedures and practices, in cooperation with the information-owners and custodians, necessary to ensure the security of information and information resources against unauthorized or accidental modification, destruction, or disclosure.</p></li> <li><p>Coordinate the review of the data security requirements, specifications, and, if applicable, third-party risk assessment of any new computer applications or services that receive, maintain, and/or share confidential data.</p></li> <li><p>Verify that security requirements are identified and risk mitigation plans are developed and contractually agreed to and obligated prior to the purchase of information technology hardware, software, and systems development services for any new high impact computer applications or computer applications that receive, maintain, and/or share confidential data.</p></li> <li><p>Serve as liaison with assigned Lee College educational centers for the purpose of monitoring information security program effectiveness and compliance with program requirements.</p></li> </ul><p>Additional duties and responsibilities may include, but are not limited to:</p> <ul> <li>Perform other duties as assigned.</li> </ul><p>Excellent benefits accrue with this full-time position. This is a security sensitive position.</p> <p>Lee College does not discriminate on the basis of gender, disability, race, color, age, religion, national origin, or veteran status.</p> <p>Minimum Qualifications:</p> <ul> <li>Bachelor’s (or higher) degree in a related field</li> <li>Five (5) years of experience designing, implementing, auditing, and/or managing information resources, information security, or risk management projects, operations, and/or programs</li> <li>Must be able to work evenings and weekends as required</li> </ul><p>Preferred Qualifications:</p> <ul> <li>Master’s (or higher) degree or a certification in a related field</li> <li>Experience in the implementation of governance, risk, and compliance strategies</li> <li>Experience working in a higher education setting</li> <li>Experience in Texas State government</li> </ul><p>Campus/Location: Main Campus - Baytown, TX</p> <p>Open Until Filled: Yes</p> <p>Special Instructions to Applicants:</p> <p>This position requires applicants to attach the following documents: resume, cover letter, and copies of transcripts for all completed college work. (Official transcripts required upon employment.)</p> <p>In addition, applicants must include a minimum of three (3) professional references on the online application.</p> <p>Please do not mail, email, fax, or deliver any documents outside of the electronic application process.</p> <p>To apply, visit <a href="http://apptrkr.com/1284649">http://apptrkr.com/1284649</a></p> <p>Lee College is an Equal Opportunity/Affirmative Action Employer, which encourages applications from qualified females, minority groups, veterans, and disabled individuals. It is the policy of Lee College to fully comply with the equal opportunity provisions of all applicable regulations and not to discriminate against any employee or applicant for employment because of gender, disability, race, color, age, religion, national origin, or veteran status in areas such as recruitment, selections, training, promotion, demotion, layoffs, terminations, rates of pay, or any other forms of compensation or benefits.</p> <p>Copyright ©2017 Jobelephant.com Inc. All rights reserved.</p> <p><a href="https://www.jobelephant.com/">https://www.jobelephant.com/</a> jeid-947e95ae65a965469777477c73e02204</p>",
how_to_apply: "<p>To apply, visit <a href="http://apptrkr.com/1284649">http://apptrkr.com/1284649</a></p>",
company: "Lee College",
company_url: "http://www.lee.edu/",
company_logo: "http://github-jobs.s3.amazonaws.com/94c2afb0-b12f-11e8-9ccf-6cc7dc734d79.jpeg",
url: "http://jobs.github.com/positions/9e6dc3a6-b12f-11e8-87af-2d3bfbae9da8"
},
{
id: "96b72c48-85d2-11e8-8bb0-af6957d6ca0a",
created_at: "Wed Sep 05 15:51:43 UTC 2018",
title: "JavaScript Engineer - Full Relocation, React & React Native",
location: "Budapest",
type: "Full Time",
description: "<p>Join Bene Studio, the React Native and React.js specialists, to learn the technology fast and continuously in our friendly team, while delivering exciting, high-quality mobile and web products together.</p> <p>Work in the heart of Europe, at the beautiful, safe and cheap Budapest! We help you with relocation, including adaptation guidance, flight ticket, temporary housing and visa services.</p> <p>The team won the Loveable Workplace Price operating in the bike, dog, and family-friendly Office of the Year 2016. We provide a MacBook Pro, mentoring, product demos and parties. We help each other in teamwork and support you to talk at conferences, meetups, workshops and to write articles. </p> <p>Salary range: net 290 000 Ft - 710 000 Ft based on your: </p> <ul> <li>professional experience</li> <li>software engineering skills</li> <li>performance and contributions to Bene Studio<br> </li> </ul><p>YOU ARE:</p> <ul> <li>a passionate JavaScript developer</li> <li>eager to develop production-ready React &amp; React Native apps</li> <li>a quick learner and love sharing knowledge</li> <li>a problem solver, there is no impossible for you</li> <li>cooperative and have great communication skills in English<br> </li> </ul><p>CHALLENGES YOU WILL BE WORKING ON:</p> <ul> <li>learn React, design and build web applications</li> <li>learn React Native, design and build great mobile applications</li> <li>you write high-quality code and meet deadlines</li> <li>automate deployment processes</li> <li>do peer reviews<br> </li> </ul><p>REQUIREMENTS: </p> <ul> <li>2+ years experience in software engineering</li> <li>JavaScript ES6</li> <li>HTML5, CSS3</li> <li>Some experience in React.js or React Native<br> </li> </ul><p>ADVANTAGES: </p> <ul> <li>Mobile development experience is a huge plus.</li> </ul><p>Watch this video, to get the Bene Studio feeling! <a href="https://www.youtube.com/watch?v=vdP-ac6MjCs">https://www.youtube.com/watch?v=vdP-ac6MjCs</a></p>",
how_to_apply: "<p>Apply here: </p> <p><a href="https://workshops.benestudio.co/javascript-engineer/">https://workshops.benestudio.co/javascript-engineer/</a></p>",
company: "Bene Studio Ltd.",
company_url: "http://www.benestudio.co",
company_logo: "http://github-jobs.s3.amazonaws.com/44fcb1e4-84eb-11e8-9bea-fe858f38c58f.JPG",
url: "http://jobs.github.com/positions/96b72c48-85d2-11e8-8bb0-af6957d6ca0a"
},
{
id: "506a1e54-b123-11e8-815d-0accd1abb7cc",
created_at: "Wed Sep 05 15:49:46 UTC 2018",
title: "Senior Software Developer (m/f)",
location: "Unterföhring, Germany",
type: "Full Time",
description: "<p><strong>What you can expect in this role</strong></p> <ul> <li> You will be responsible for designing and developing new application components to ensure a high-quality software solution </li> <li> Furthermore, you will support quality assurance and optimization through code reviews and error analyses in close cooperation with the test management team </li> <li> Working in an agile environment, the (development) team will handle the planning and implementation of all software development tasks </li> <li>You will implement various back-end components, focusing on data integrity and performance </li> <li> For implementation, you will primarily use technologies such as Spring, Hibernate, Docker and Apache Kafka </li> <li> You will support the entire software life cycle, from conceptual design to development and support in daily operation </li> </ul><p><strong>Your essential experience and education</strong></p> <ul> <li>You have a degree in Computer Science, Business Informatics, Engineering or a comparable subject </li> <li>You have at least five years of professional experience in software engineering, during which you gained in-depth knowledge of traditional and agile software projects </li> <li>Practical experience in small to medium-sized software development projects, from the concept to implementation and normal operation, round out your profile </li> <li>You have expert knowledge of Java, web technologies and relational databases (such as MySQL, Oracle and Informix) and experience in working with microservices architectures and messaging systems (ideally Apache Kafka) </li> <li>Basic knowledge of using container technologies such as Docker or Kubernetes is an advantage </li> <li>Your strengths include excellent analytical, communication and conceptual skills, a structured way of working, poise, power of persuasion and a focus on clients </li> <li>You have very good German and English skills </li> </ul><p><strong>What’s in it for you?</strong></p> <ul> <li>With the ProSiebenSat.1-Academy we offer a huge amount of trainings and workshops for your further education </li> <li>We have flexible working hours with home office and 30 days of vacation </li> <li>A modern workplace with offers for sports (Yoga, Football and other workouts), post office, laundry service, coffee bars and free wi-fi on the hole campus </li> </ul><p>ProSiebenSat.1 Group is one of Europe's leading media companies. Our stations SAT.1, ProSieben, kabel eins, sixx, SAT.1 Gold, ProSieben MAXX and kabel eins Doku captivate millions of viewers every day. But extraordinary TV entertainment is just one part of our concept for success. Today, our growth is based on four segments: German-speaking TV business, our digital units with a large entertainment and e-commerce portfolio, and our international program production and sales house. We have consistently diversified our company in recent years and created additional sources of revenue. This also reflects our vision: We are establishing ProSiebenSat.1 as a leading broadcasting, digital entertainment, and commerce powerhouse.</p>",
how_to_apply: "<p>If we have aroused your interest, then <a href="https://www.prosiebensat1-jobs.com/Senior-Software-Developer-mf-eng-f8273.html?agid=67">send off your detailed application</a> to us today. Discover more at <a href="tech.prosiebensat1.com">tech.prosiebensat1.com</a>.</p>",
company: "ProSiebenSat1 Applications GmbH",
company_url: "https://www.fascinating-people.de/en",
company_logo: "http://github-jobs.s3.amazonaws.com/2a5d2112-b122-11e8-9ef3-e9a2306b431f.jpeg",
url: "http://jobs.github.com/positions/506a1e54-b123-11e8-815d-0accd1abb7cc"
},
{
id: "4e406d5e-b123-11e8-9fb4-a7976b90d0e0",
created_at: "Wed Sep 05 15:49:42 UTC 2018",
title: "Platform Engineer - Focus Kubernetes (m/f)",
location: "Unterföhring, Germany",
type: "Full Time",
description: "<p><strong>What you can expect in this role</strong></p> <ul> <li>You help us develop and maintain our self-service container platform, which is based on Open-Source component, for our B2B applications </li> <li>You will work with bleeding edge technology with a lot of room to experiment </li> <li>A dynamic and self-organized team </li> <li>You will take on-call duty </li> </ul><p><strong>Your essential experience and education</strong></p> <ul> <li>You have a degree in computer science, engineering or any other comparable education </li> <li>You preferred OS is not Windows and you are safe navigating with a Command Line </li> <li>Ideally, you have experience in container or cloud technology </li> <li>You can develop tools and solutions by our own in the common programming languages (we use Python, JS, Go) </li> <li>You have experience in the container lifecycle and modern development workflows </li> <li>Excellent German and English communication (oral and written) skills </li> </ul><p><strong>What's in it for you?</strong></p> <ul> <li>Take advantage of our wide range of training and development opportunities offered by the ProSiebenSat.1 Academy </li> <li>Benefit from a flexible work schedule with home office and 30 vacation days per year </li> <li>Work on modern fully equipped workplaces and use our wide range of sports (including yoga, football or workouts), post office, laundry and ironing service as well as many cafés and Wifi on campus </li> <li>In addition to the campus's own daycare or a childcare allowance, there is a family service with free consultation </li> <li>Enjoy an open corporate culture without dress code in the dynamic environment of the media industry </li> </ul><p>ProSiebenSat.1 Group is one of Europe's leading media companies. Our stations SAT.1, ProSieben, kabel eins, sixx, SAT.1 Gold, ProSieben MAXX and kabel eins Doku captivate millions of viewers every day. But extraordinary TV entertainment is just one part of our concept for success. Today, our growth is based on four segments: German-speaking TV business, our digital units with a large entertainment and e-commerce portfolio, and our international program production and sales house. We have consistently diversified our company in recent years and created additional sources of revenue. This also reflects our vision: We are establishing ProSiebenSat.1 as a leading broadcasting, digital entertainment, and commerce powerhouse.</p>",
how_to_apply: "<p>If we have aroused your interest, then <a href="https://www.prosiebensat1-jobs.com/Platform-Engineer-mf-Focus-Kubernetes-eng-f8833.html?agid=67">send off your detailed application</a> to us today. Discover more at <a href="tech.prosiebensat1.com">tech.prosiebensat1.com</a>.</p>",
company: "ProSiebenSat1 Applications GmbH",
company_url: "https://www.fascinating-people.de/en",
company_logo: "http://github-jobs.s3.amazonaws.com/98b9a018-b122-11e8-86b7-26ffba94490d.jpeg",
url: "http://jobs.github.com/positions/4e406d5e-b123-11e8-9fb4-a7976b90d0e0"
},
{
id: "4c71d6c0-b123-11e8-99a5-26b1b460cde6",
created_at: "Wed Sep 05 15:49:39 UTC 2018",
title: "Big Data Architect (m/f)",
location: "Unterföhring, Germany",
type: "Full Time",
description: "<p><strong>What you can expect in this role</strong></p> <ul> <li>As Big Data Architect you are responsible for the evolution of our big data platform landscape, based on technologies like Spark and Exasol </li> <li>Leading a team of experts, you will answer the design of our data integration framework (written in Scala) which is used by several teams of developers </li> <li>Taking care of nonfunctional requirements you will contribute to the outstanding end user experience of our solution platform </li> <li>You will have the creative leeway to explore new possibilities brought about by technology to make the best use of our media data. To this end you will work closely together with our business experts. </li> <li>You will guide our highly-motivated team of platform developers </li> </ul><p><strong>Your essential experience and education</strong></p> <ul> <li>Degree in computer science or related discipline </li> <li>Experience in the development of enterprise systems for processing of large volumes of data, ideally using Spark </li> <li>You have deep knowledge of system architecture and design principles and you can educate others in these areas </li> <li>Agile software development and continuous integration are familiar ground to you </li> <li> With us you share the highest regard for quality of individual and team results </li> <li> Clarity of thought, vision, team-orientation and flexibility </li> <li> Solid language skills in German </li> </ul><p><strong>What’s in it for you?</strong></p> <ul> <li>Take advantage of our wide range of training and development opportunities offered by the ProSiebenSat.1 Academy </li> <li>Benefit from a flexible work schedule with home office and 30 vacation days per year </li> <li>Work on modern fully equipped workplaces and use our wide range of sports (including yoga, football or workouts), post office, laundry and ironing service as well as many cafés and Wifi on campus </li> <li>In addition to the campus's own daycare or a childcare allowance, there is a family service with free consultation </li> <li>Enjoy an open corporate culture without dress code in the dynamic environment of the media industry </li> <li>This vacancy can be filled in full time as well as in part time </li> </ul><p>ProSiebenSat.1 Group is one of Europe's leading media companies. Our stations SAT.1, ProSieben, kabel eins, sixx, SAT.1 Gold, ProSieben MAXX and kabel eins Doku captivate millions of viewers every day. But extraordinary TV entertainment is just one part of our concept for success. Today, our growth is based on four segments: German-speaking TV business, our digital units with a large entertainment and e-commerce portfolio, and our international program production and sales house. We have consistently diversified our company in recent years and created additional sources of revenue. This also reflects our vision: We are establishing ProSiebenSat.1 as a leading broadcasting, digital entertainment, and commerce powerhouse.</p>",
how_to_apply: "<p>If we have aroused your interest, then <a href="https://www.prosiebensat1-jobs.com/Big-Data-Architect-mw-de-f9181.html?agid=67">send off your detailed application</a> to us today. Discover more at <a href="tech.prosiebensat1.com">tech.prosiebensat1.com</a>.</p>",
company: "ProSiebenSat1 Applications GmbH",
company_url: "https://www.fascinating-people.de/en",
company_logo: "http://github-jobs.s3.amazonaws.com/9b0e31d0-b122-11e8-99da-235364a95605.jpeg",
url: "http://jobs.github.com/positions/4c71d6c0-b123-11e8-99a5-26b1b460cde6"
},
{
id: "4a94ea54-b123-11e8-9d29-21f1cc235b13",
created_at: "Wed Sep 05 15:49:36 UTC 2018",
title: "Senior Java Engineer (m/f)",
location: "Unterföhring, Germany",
type: "Full Time",
description: "<p>As a Senior Java Engineer you are pushing the development of our TV and online ad sales and playout applications forward.</p> <p><strong>What you can expect in this role</strong></p> <ul> <li>Following agile development principles everyone has full stack responsibility starting from Dockerfiles to REST APIs </li> <li>Your tasks include the automation of testing on different levels as well as our build pipelines (Docker/gitlab CI) </li> <li>You are in charge of pushing and running our applications on our container orchestration platform </li> <li>You are actively involved in the restructuring of our legacy systems </li> <li>We are one team. We work together and support each other. We ship and party together </li> </ul><p>__Your essential experience and education __</p> <ul> <li>You have successfully completed a degree in computer science, engineering or similar and have several years of experience in software engineering, software tooling and application operations </li> <li>You are passionate for java engineering; Maven and Gradle are your best buddies and Spring Boot is the first thing that comes to your mind when you start building a new application </li> <li>In order to ensure clean processing through the CI pipeline and the production on AWS or Kubernetes you put your code into containers and thus have proficient experience with Docker </li> <li>API and automation is the most important for you to safeguard a sustainable development and to facilitate work for your colleagues developing the JS front end </li> <li>Perfect Linux and git skills will help you along in your daily business </li> <li>In order to improve the delivery performance you are willing to go the extra mile to acquire new skills and integrate new tools __What's in it for you?__ <ul> <li>Take advantage of our wide range of training and development opportunities offered by the ProSiebenSat.1 Academy </li> <li>Benefit from a flexible work schedule with home office and 30 vacation days per year </li> <li>Work on modern fully equipped workplaces and use our wide range of sports (including yoga, football or workouts), post office, laundry and ironing service as well as many cafés and Wifi on campus </li> <li>In addition to the campus's own daycare or a childcare allowance, there is a family service with free consultation </li> <li>Enjoy an open corporate culture without dress code in the dynamic environment of the media industry </li> </ul> <p>ProSiebenSat.1 Group is one of Europe's leading media companies. Our stations SAT.1, ProSieben, kabel eins, sixx, SAT.1 Gold, ProSieben MAXX and kabel eins Doku captivate millions of viewers every day. But extraordinary TV entertainment is just one part of our concept for success. Today, our growth is based on four segments: German-speaking TV business, our digital units with a large entertainment and e-commerce portfolio, and our international program production and sales house. We have consistently diversified our company in recent years and created additional sources of revenue. This also reflects our vision: We are establishing ProSiebenSat.1 as a leading broadcasting, digital entertainment, and commerce powerhouse.</p> </li> </ul>",
how_to_apply: "<p>If we have aroused your interest, then <a href="https://www.prosiebensat1-jobs.com/Clean-Code-Evangelist-Senior-Java-Engineer-mf-eng-f9544.html?agid=67">send off your detailed application</a> to us today. Discover more at <a href="tech.prosiebensat1.com">tech.prosiebensat1.com</a>.</p>",
company: "ProSiebenSat1 Applications GmbH",
company_url: "https://www.fascinating-people.de/en",
company_logo: "http://github-jobs.s3.amazonaws.com/9d4c5ed6-b122-11e8-949a-dacb35dd9935.jpeg",
url: "http://jobs.github.com/positions/4a94ea54-b123-11e8-9d29-21f1cc235b13"
},
{
id: "48db685a-b123-11e8-8802-7fbcc5666369",
created_at: "Wed Sep 05 15:49:33 UTC 2018",
title: "DevOps Engineer (m/f)",
location: "Unterföhring, Germany",
type: "Full Time",
description: "<p><strong>What you can expect in this role</strong></p> <ul> <li>Your responsibilities will include further development and operation of CI/CD pipelines in our business projects; you will plan, control and carry out software deployments </li> <li>You’ll be responsible for implementing cross-project standards for logging, monitoring and alerting; and continuously enhance standards together with other engineers and architects </li> <li>This also includes advising and supporting the application developers in the areas of CI/CD, logging and monitoring </li> <li>You’ll create and further develop automated test sets, including tests for non-functional areas (e.g. load and performance) </li> <li>In addition, you’ll test and introduce new components in the tool chain; you maintain the existing tools with updates and patches </li> <li>What’s more, you’ll ensure high application availability for our clients within and outside of business hours (on-call duty) </li> </ul><p><strong>Your essential experience and education</strong></p> <ul> <li>You have a degree in Media and Computing, Computer Science or Information Technology, or you have completed comparable vocational training with related professional experience </li> <li>Ideally, you not only have experience with application development in Java (for example with Spring (Boot), Hibernate, Git or Maven), but have also used tools like GitLab CI, Jenkins, Ansible or Kibana for automation and operation </li> <li>In addition, you have experience running Java application servers, Docker, Kubernetes and possibly OpenShift </li> <li>You’re well-versed in relational databases such as PostgreSQL, MySQL, and possible also in NoSQL DBMS (for example MongoDB and Cassandra). Ideally, you also have some knowledge of HTML5, CSS and JavaScript (Angular, React, Vue) </li> <li>You spent enough time reading Kafka in school, and now you’d rather use Kafka for asynchronous messaging. You’re familiar with JSON and REST APIs </li> <li>Your favorite way to collaborate with your team is in Jira, Confluence and Microsoft Teams or Slack </li> <li>You can quickly familiarize yourself with complex technical issues and resolve them to improve our systems and procedures </li> <li>You communicate with technicians, service providers and users on equal footing, using your fluent German and English __What's in it for you?__ <ul> <li>Take advantage of our wide range of training and development opportunities offered by the ProSiebenSat.1 Academy </li> <li>Benefit from a flexible work schedule with home office and 30 vacation days per year </li> <li>Work on modern fully equipped workplaces and use our wide range of sports (including yoga, football or workouts), post office, laundry and ironing service as well as many cafés and Wifi on campus </li> <li>In addition to the campus's own daycare or a childcare allowance, there is a family service with free consultation </li> <li>Enjoy an open corporate culture without dress code in the dynamic environment of the media industry </li> </ul> <p>ProSiebenSat.1 Group is one of Europe's leading media companies. Our stations SAT.1, ProSieben, kabel eins, sixx, SAT.1 Gold, ProSieben MAXX and kabel eins Doku captivate millions of viewers every day. But extraordinary TV entertainment is just one part of our concept for success. Today, our growth is based on four segments: German-speaking TV business, our digital units with a large entertainment and e-commerce portfolio, and our international program production and sales house. We have consistently diversified our company in recent years and created additional sources of revenue. This also reflects our vision: We are establishing ProSiebenSat.1 as a leading broadcasting, digital entertainment, and commerce powerhouse.</p> </li> </ul>",
how_to_apply: "<p>If we have aroused your interest, then <a href="https://www.prosiebensat1-jobs.com/DevOps-Engineer-mf-eng-j9918.html?agid=67">send off your detailed application</a> to us today. Discover more at <a href="tech.prosiebensat1.com">tech.prosiebensat1.com</a>.</p>",
company: "ProSiebenSat1 Applications GmbH",
company_url: "https://www.fascinating-people.de/en",
company_logo: "http://github-jobs.s3.amazonaws.com/9fc1e8ac-b122-11e8-8c80-b5622aacde06.jpeg",
url: "http://jobs.github.com/positions/48db685a-b123-11e8-8802-7fbcc5666369"
},
{
id: "47015170-b123-11e8-9e85-ef9588ed6c0b",
created_at: "Wed Sep 05 15:49:30 UTC 2018",
title: "DevOps Engineer (m/f)",
location: "Unterföhring, Germany",
type: "Full Time",
description: "<p>We are looking for a Mobile Engineer with experience in both Android and iOS to build a world-class video player for our customers. If you love to work in a Test- Driven Development environment and enjoy Pair Programming sessions, then this might be the right challenge for you.</p> <p><strong>What you can expect in this role</strong></p> <ul> <li>Operating and improving central Sales solution systems with a high number of interfaces and an End-to-end ownership of operations on all layer of the systems (software, middleware, database and infrastructure) </li> <li>Automation of configuration, scheduling, monitoring and deployment of the systems and further optimization of all services </li> <li>Management of incidents and issues occurring in production ensuring highest availability of the business critical systems </li> <li>Provide Technical expertise and architectural know-how </li> <li>Strive to deliver the best possible experience for the units utilizing the systems </li> <li>Assess relevance of new technologies </li> </ul><p>__Your essential experience and education __</p> <ul> <li>Thorough knowledge of Linux and open source software in general </li> <li>Previous experience in maintaining large IT Platforms and Solutions with a combination of legacy systems and new technologies </li> <li>Knowledge of at least one of the main configuration management tool (i.e Chef,puppet,Ansible, Salt) and experience using AWS </li> <li>Strong understanding of IT security and understanding of Orchestration (containers/VM) and CI/CD tools and practices </li> <li>Advanced understanding of the major web application landscape (LAMP etc) </li> <li>Sound Knowledge in Operation of Java Applications (J2EE) and Websphere is a requirement </li> <li>Knowledge of Informix database and/or Solaris is a plus and experience in setting up High Availability environments </li> <li>Knowledge of the following technologies, while not required, are strongly desired: ELK/EFK, Docker, Saltstack/Ansible, Python, Nagios/centreon, NoSQL Databases (MongoDB), InfluxDB </li> <li>Good social skills and ability to troubleshoot/describe issues effectively </li> <li>Fluent English and German is required </li> </ul><p><strong>What's in it for you?</strong></p> <ul> <li>Take advantage of our wide range of training and development opportunities offered by the ProSiebenSat.1 Academy </li> <li>Benefit from a flexible work schedule with home office and 30 vacation days per year </li> <li>Work on modern fully equipped workplaces and use our wide range of sports (including yoga, football or workouts), post office, laundry and ironing service as well as many cafés and Wifi on campus </li> <li>In addition to the campus's own daycare or a childcare allowance, there is a family service with free consultation </li> <li>Enjoy an open corporate culture without dress code in the dynamic environment of the media industry </li> </ul><p>ProSiebenSat.1 Group is one of Europe's leading media companies. Our stations SAT.1, ProSieben, kabel eins, sixx, SAT.1 Gold, ProSieben MAXX and kabel eins Doku captivate millions of viewers every day. But extraordinary TV entertainment is just one part of our concept for success. Today, our growth is based on four segments: German-speaking TV business, our digital units with a large entertainment and e-commerce portfolio, and our international program production and sales house. We have consistently diversified our company in recent years and created additional sources of revenue. This also reflects our vision: We are establishing ProSiebenSat.1 as a leading broadcasting, digital entertainment, and commerce powerhouse.</p>",
how_to_apply: "<p>If we have aroused your interest, then <a href="https://www.prosiebensat1-jobs.com/DevOps-Engineer-mf-eng-f10032.html?agid=67">send off your detailed application</a> to us today. Discover more at <a href="tech.prosiebensat1.com">tech.prosiebensat1.com</a>.</p>",
company: "ProSiebenSat1 Applications GmbH",
company_url: "https://www.fascinating-people.de/en",
company_logo: "http://github-jobs.s3.amazonaws.com/a2276ff4-b122-11e8-9c4a-442c06387705.jpeg",
url: "http://jobs.github.com/positions/47015170-b123-11e8-9e85-ef9588ed6c0b"
},
{
id: "45450980-b123-11e8-8a85-a9fed8d6823e",
created_at: "Wed Sep 05 15:49:27 UTC 2018",
title: "Junior Salesforce Developer (m/f)",
location: "Unterföhring, Germany",
type: "Full Time",
description: "<p>The Sales Solution Team is a cross-functional team of highly experienced individuals with deep competences in cutting-edge media technologies, cloud technologies, software development, quality assurance, and product management within the ProSiebenSat1 Applications GmbH. We master evolutionary design, development, and operation of APP’s Sales pipeline including CRM, Ad-Sales, Fulfillment, Billing and analytics.</p> <p><strong>Our Tech Stack</strong></p> <ul> <li>Our application landscape is a mix of internally developed services, 3rd party software, and SaaS components </li> <li>We develop applications on the Salesforce platform, using Force.com, Lightning, Javascript, and other Salesforce-related technologies </li> <li>Our stack enables new business ideas and short time-to-market in a dynamic environment using Agile methodologie </li> <li>Cloud, a DevOps-mindset, and lightweight processes help us to achieve that </li> </ul><p><strong>What you can expect in this role</strong></p> <ul> <li>You push the team to deliver high quality code through Test-Driven Development, Domain-Driven Design and Extreme Programming techniques </li> <li>You engineer applications that scale by design and whose status and health is visible to the outside </li> <li>You are part of an Agile environment and will be coached to be an active member in our Agile communit </li> <li>You will be encouraged and challenged to constantly improve your skill set </li> <li>You monitor quality of the features delivered and ensure that the team has the necessary tools to automate as many of their tasks as possible (Continuous Integration etc.) </li> <li>You follow market trends and analyze new technologies and approaches for improving engineering quality and code sustainability </li> </ul><p><strong>Your essential experience and education</strong></p> <ul> <li>You have a university degree in computer science, information technology, media engineering, or equivalent </li> <li>You love writing code from the bottom of your heart and you believe in clean code as one of the means for sustainable development of applications </li> <li>You have made first working experiences in software development, e.g. as a student employee or in an internship </li> <li>You possess very good English skills. German is a plus </li> </ul><p><strong>What’s in it for you?</strong></p> <ul> <li>Take advantage of our wide range of training and development opportunities offered by the ProSiebenSat.1 Academy </li> <li>Benefit from a flexible work schedule with home office and 30 vacation days per year </li> <li>Work on modern fully equipped workplaces and use our wide range of sports (including yoga, football or workouts), post office, laundry and ironing service as well as many cafés and Wifi on campus </li> <li>In addition to the campus's own daycare or a childcare allowance, there is a family service with free consultation </li> <li>Enjoy an open corporate culture without dress code in the dynamic environment of the media industry </li> <li>This vacancy can be filled both full-time and part-time </li> </ul><p>ProSiebenSat.1 Group is one of Europe's leading media companies. Our stations SAT.1, ProSieben, kabel eins, sixx, SAT.1 Gold, ProSieben MAXX and kabel eins Doku captivate millions of viewers every day. But extraordinary TV entertainment is just one part of our concept for success. Today, our growth is based on four segments: German-speaking TV business, our digital units with a large entertainment and e-commerce portfolio, and our international program production and sales house. We have consistently diversified our company in recent years and created additional sources of revenue. This also reflects our vision: We are establishing ProSiebenSat.1 as a leading broadcasting, digital entertainment, and commerce powerhouse.</p>",
how_to_apply: "<p>If we have aroused your interest, then <a href="https://www.prosiebensat1-jobs.com/Junior-Salesforce-Developer-mf-de-f10681.html?agid=67">send off your detailed application</a> to us today. Discover more at <a href="tech.prosiebensat1.com">tech.prosiebensat1.com</a>.</p>",
company: "ProSiebenSat1 Applications GmbH",
company_url: "https://www.fascinating-people.de/en",
company_logo: "http://github-jobs.s3.amazonaws.com/a4697e60-b122-11e8-8be1-d96221d7d02f.jpeg",
url: "http://jobs.github.com/positions/45450980-b123-11e8-8a85-a9fed8d6823e"
},
{
id: "43912574-b123-11e8-92a2-a3003d2707ff",
created_at: "Wed Sep 05 15:49:25 UTC 2018",
title: "Tech Assistant (m/f)",
location: "Unterföhring, Germany",
type: "Full Time",
description: "<p>The Sales Solution Team is a cross-functional team of highly experienced individuals with deep competences in cutting-edge media technologies, cloud technologies, software development, quality assurance, and product management within the ProSiebenSat1 Applications GmbH. We master evolutionary design, development, and operation of APP’s Sales pipeline including CRM, Ad-Sales, Fulfillment, Billing and analytics.</p> <p><strong>What you can expect in this role</strong></p> <ul> <li>You support our Product Owner, Development and Operations team as well as the team heads in their daily work. </li> <li>You take care of writing and following up with project proposals in close consultation with our Product Owners. </li> <li>The management of our service provider, the preparation of tenders for new service providers and their onboarding and offboarding is also in your area of ​​responsibility. </li> <li>You take over various administrative activities, such as travel planning, event preparation, etc. </li> </ul><p><strong>Your essential experience and education</strong></p> <ul> <li>You have a university degree in business administration or an equivalent professional education. </li> <li>You already gained experience as a Team Assistant/Support within a Tech Company/Department </li> <li>You are experienced in the management of service provider, preparing tenders and writing (IT) project applications </li> <li>You possess a very good knowledge with the MS Office package </li> <li>You have an independent and structured way of working </li> <li>You take over responsibility, are an organizational talent and have high communication skills </li> <li>You possess very good German and English skills </li> </ul><p><strong>What’s in it for you?</strong></p> <ul> <li>Take advantage of our wide range of training and development opportunities offered by the ProSiebenSat.1 Academy </li> <li>Benefit from a flexible work schedule with home office and 30 vacation days per year </li> <li>Work on modern fully equipped workplaces and use our wide range of sports (including yoga, football or workouts), post office, laundry and ironing service as well as many cafés and Wifi on campus </li> <li>In addition to the campus's own daycare or a childcare allowance, there is a family service with free consultation </li> <li>Enjoy an open corporate culture without dress code in the dynamic environment of the media industry </li> <li>This vacancy can be filled both full-time and part-time </li> </ul><p>ProSiebenSat.1 Group is one of Europe's leading media companies. Our stations SAT.1, ProSieben, kabel eins, sixx, SAT.1 Gold, ProSieben MAXX and kabel eins Doku captivate millions of viewers every day. But extraordinary TV entertainment is just one part of our concept for success. Today, our growth is based on four segments: German-speaking TV business, our digital units with a large entertainment and e-commerce portfolio, and our international program production and sales house. We have consistently diversified our company in recent years and created additional sources of revenue. This also reflects our vision: We are establishing ProSiebenSat.1 as a leading broadcasting, digital entertainment, and commerce powerhouse.</p>",
how_to_apply: "<p>If we have aroused your interest, then <a href="https://www.prosiebensat1-jobs.com/Tech-Assistant-mf-de-f10690.html?agid=67">send off your detailed application</a> to us today. Discover more at <a href="tech.prosiebensat1.com">tech.prosiebensat1.com</a>.</p>",
company: "ProSiebenSat1 Applications GmbH",
company_url: "https://www.fascinating-people.de/en",
company_logo: "http://github-jobs.s3.amazonaws.com/a882c3a8-b122-11e8-9086-07f14b86a9ed.jpeg",
url: "http://jobs.github.com/positions/43912574-b123-11e8-92a2-a3003d2707ff"
},
{
id: "41f1190e-b123-11e8-8118-6df89ef1fb57",
created_at: "Wed Sep 05 15:49:22 UTC 2018",
title: "DevOps Specialist (m/f)",
location: "Unterföhring, Germany",
type: "Full Time",
description: "<p>The Sales Solution Team is a cross-functional team of highly experienced individuals with deep competences in cutting-edge media technologies, cloud technologies, software development, quality assurance, and product management within the ProSiebenSat1 Applications GmbH. We master evolutionary design, development, and operation of APP’s Sales pipeline including CRM, Ad-Sales, Fulfillment, Billing and analytics. <strong>Our Tech Stack</strong></p> <ul> <li>Our application landscape is composed of a mix of internally developed services, 3rd party software, and SaaS components. </li> <li>We are developing in Java (Spring-Boot), Scala/Spark building containerized microservices that run on AWS and K8s as well as client components using web such as Angular </li> <li>Our tech stack enables new business ideas and short time-to-market in a very dynamic environment using gitlab-ci, Kafka, Artifactory or K8s </li> <li>Cloud, a DevOps-mindset, lightweight processes, and KPI-driven optimization are enablers for us to achieve that </li> </ul><p><strong>What you can expect in this role</strong></p> <ul> <li>You build, maintain and constantly improve our CI pipeline and its tools to enable us to constantly deliver high-quality features </li> <li>You find a place for all component tests to run on and orchestrate environments for integration tests </li> <li>You engineer applications that utilize the power and flexibility of the cloud </li> <li>You make technology decisions and where necessary you conduct Proof-of-Concept evaluations to support your decision </li> <li>You monitor quality of the features delivered and ensure that the team has the necessary tools to automate as many of their tasks as possible (Continuous Integration, Continuous Delivery) </li> <li>You follow market trends and analyze new technologies and approaches for improving engineering quality and code sustainability </li> </ul><p><strong>Your essential experience and education</strong></p> <ul> <li>You have a university degree in computer science, information technology, media engineering, or equivalent </li> <li>You love writing code from the bottom of your heart and you believe in clean code as one of the means for sustainable development of applications </li> <li>You have professional working experience in software development using Java and have a proven track record for delivering high quality code </li> <li>Ideally you have experience developing for cloud execution platforms. </li> <li>You possess very good English skills. German is a plus </li> </ul><p><strong>What’s in it for you?</strong></p> <ul> <li>Take advantage of our wide range of training and development opportunities offered by the ProSiebenSat.1 Academy </li> <li>Benefit from a flexible work schedule with home office and 30 vacation days per year </li> <li>Work on modern fully equipped workplaces and use our wide range of sports (including yoga, football or workouts), post office, laundry and ironing service as well as many cafés and Wifi on campus </li> <li>In addition to the campus's own daycare or a childcare allowance, there is a family service with free consultation </li> <li>Enjoy an open corporate culture without dress code in the dynamic environment of the media industry </li> <li>This vacancy can be filled both full-time and part-time </li> </ul><p>ProSiebenSat.1 Group is one of Europe's leading media companies. Our stations SAT.1, ProSieben, kabel eins, sixx, SAT.1 Gold, ProSieben MAXX and kabel eins Doku captivate millions of viewers every day. But extraordinary TV entertainment is just one part of our concept for success. Today, our growth is based on four segments: German-speaking TV business, our digital units with a large entertainment and e-commerce portfolio, and our international program production and sales house. We have consistently diversified our company in recent years and created additional sources of revenue. This also reflects our vision: We are establishing ProSiebenSat.1 as a leading broadcasting, digital entertainment, and commerce powerhouse.</p>",
how_to_apply: "<p>If we have aroused your interest, then <a href="https://www.prosiebensat1-jobs.com/DevOps-Specialist-mf-eng-f10691.html?agid=67">send off your detailed application</a> to us today. Discover more at <a href="tech.prosiebensat1.com">tech.prosiebensat1.com</a>.</p>",
company: "ProSiebenSat1 Applications GmbH",
company_url: "https://www.fascinating-people.de/en",
company_logo: "http://github-jobs.s3.amazonaws.com/ab00a654-b122-11e8-848a-5441e4cfb2de.jpeg",
url: "http://jobs.github.com/positions/41f1190e-b123-11e8-8118-6df89ef1fb57"
},
{
id: "e973d6e2-b120-11e8-9167-e63aea1fddd0",
created_at: "Wed Sep 05 15:32:34 UTC 2018",
title: "Senior Salesforce Developer / Architect (m/f)",
location: "Unterföhring, Germany",
type: "Full Time",
description: "<p>You will be part of the Sales Solution Team, a cross-functional team of highly experienced individuals with deep competences in cutting-edge media technologies, cloud technologies, software development, quality assurance, and product management within the ProSiebenSat1 Applications GmbH. We master evolutionary design, development, and operation of APP’s Sales pipeline including CRM, Ad-Sales, Fulfillment, Billing and analytics. <strong>Our Tech Stack</strong></p> <ul> <li> Our Salesforce application landscape is composed of a mix of internally developed customizations and services, supported by an ever-evolving CI/CD-pipeline. </li> <li> We’re developing in Apex and Lightning, with a strong focus on best practices to ensure fast, version-controlled and semi-automated releases. </li> <li> An agile-, DevOps-oriented mindset, lightweight processes, and business value driven optimizations are our core enablers. </li> </ul><p><strong>What you can expect in this role</strong></p> <ul> <li> You enable the team to deliver code of a high quality standard through Pair and Mob Programming Sessions, code reviews, best practices and participation in our Community Of Practice. </li> <li> What about TDD or DDD as a Salesforce development approach? Sure, let’s go for it! </li> <li> You make solid technology decisions based on analysis and Proof-of-Concept evaluations if needed. </li> <li> Defining release strategies including branching, CI and development workflows </li> <li> You monitor the quality of the features delivered and ensure that the team has the necessary tools to automate as many of their tasks as possible (Continuous Integration, Continuous Delivery) </li> <li> You follow market trends, analyze new technologies and approaches for improving engineering quality and code sustainability. </li> <li> You are brimming with anticipation for the final release of SFDX </li> </ul><p><strong>Your essential experience and education</strong></p> <ul> <li>You have a university degree in computer science, information technology, media engineering, or equivalent. </li> <li>You love writing code from the bottom of your heart and you believe in clean code as one of the means for sustainable development on the SFDC platform. </li> <li>You have a firm understanding of best practices in a Salesforce driven environment, such as but not limited to: avoiding SF-governor limits (in an (a-)synchronous context), making sure the code is bulkified, writing thorough, repeatable, and independent Unit Test </li> <li>You have a professional working experience in software development using Apex and Lightning and have a proven track record for delivering high quality code. </li> <li>Ideally you have experience with DevOps-tools like Git and Jenkins or equivalent to ensure a robust CI/CD-process. </li> <li>You possess very good English skills. German is a plus </li> </ul><p><strong>What’s in it for you?</strong></p> <ul> <li>As an agile and diverse team, we value the direct approach at eye level and the constant strive for improving professionally and personally </li> <li>Take advantage of our wide range of training and development opportunities offered by the ProSiebenSat.1 Academy </li> <li>Benefit from a flexible work schedule with home office and 30 vacation days per year </li> <li>On our campus we offer a wide range of sports (including yoga, football or workouts), post office, laundry and ironing service as well as many cafés and Wifi on campus </li> <li>In addition to the campus's own daycare or a childcare allowance, there is a family service with free consultation </li> <li>Munich is one of the greatest Cities to live in Germany. With its closeness to the Alps you can enjoy skiing or hiking in the Alps within an hour drive from the Office. </li> <li>Enjoy an open corporate culture without dress code in the dynamic environment of the media industry </li> <li>This vacancy can be filled both full-time and part-time </li> </ul><p>ProSiebenSat.1 Group is one of Europe's leading media companies. Our stations SAT.1, ProSieben, kabel eins, sixx, SAT.1 Gold, ProSieben MAXX and kabel eins Doku captivate millions of viewers every day. But extraordinary TV entertainment is just one part of our concept for success. Today, our growth is based on four segments: German-speaking TV business, our digital units with a large entertainment and e-commerce portfolio, and our international program production and sales house. We have consistently diversified our company in recent years and created additional sources of revenue. This also reflects our vision: We are establishing ProSiebenSat.1 as a leading broadcasting, digital entertainment, and commerce powerhouse.</p>",
how_to_apply: "<p>If we have aroused your interest, then <a href="https://www.prosiebensat1-jobs.com/Senior-Salesforce-Developer-Architect-mf-de-f10693.html?agid=67">send off your detailed application</a> to us today. Discover more at <a href="tech.prosiebensat1.com">tech.prosiebensat1.com</a>.</p>",
company: "ProSiebenSat1 Applications GmbH",
company_url: "https://www.fascinating-people.de/en",
company_logo: "http://github-jobs.s3.amazonaws.com/e34bbc76-b120-11e8-982a-dfe1a0f046ee.jpeg",
url: "http://jobs.github.com/positions/e973d6e2-b120-11e8-9167-e63aea1fddd0"
},
{
id: "06e0b540-b0f1-11e8-9a10-3d6ee608d4a1",
created_at: "Wed Sep 05 09:51:07 UTC 2018",
title: "Researcher - Firmware",
location: "Nieuwegein",
type: "Full Time",
description: "<p><strong>Researcher - Firmware</strong><br><em>Nieuwegein</em><br><br> The Diagnostics &amp; Prognostics team within the SKF Research &amp; Technology Development group is responsible for generating new knowledge and technology in the field of bearing and machine monitoring. The deliverables of this team are directly supporting SKF’s journey through the digital transformation and will change the way we do business. By obtaining and interpreting measurement data from bearings in the field, SKF strives for a paradigm shift from unplanned to scheduled maintenance. This enables SKF to complement classical transactional business models with an accelerated growth in performance-based service contracts.<br><br> To strengthen our team in Nieuwegein we are looking for a:<br><strong>Researcher – Firmware</strong><br><br><strong>Job description:</strong><br> In this role, you will be working in multiple R&amp;D projects. In accordance with project needs, your main responsibilities will be (but are not limited to):</p> <ul> <li>Have an active role in development and implementation of new technology by taking a leading technical role in the development of firmware. This concerns requirement definitions, product architecture and detailed design</li> <li>Apply structured and modular methods to ensure re-usability, maintainability and easy transfer to product development.=</li> <li>Knowledge with application software related to embedded systems. (e.g. to enable unit and system tests and to port algorithms from PC to specific target platforms.)</li> <li>Receive, review and challenge work done by external partners</li> <li>Manage software competence within the department and ensure good collaboration with peers from other SKF development groups</li> </ul><p><br><strong>Job requirements:</strong></p> <ul> <li> <strong>Master's degree </strong>in <strong>Electrical </strong>or <strong>Software Engineering </strong>with a focus on embedded systems</li> <li>Good knowledge of the following software languages: <strong>C</strong>, <strong>C++</strong> </li> <li>Knowledge of <strong>ARM</strong>, <strong>Microchip </strong>(PIC) based platforms running with or without RTOS</li> <li>Good <strong>understanding </strong>of (wireless / battery powered) <strong>sensor systems </strong>and affinity with mechanical systems and signal processing</li> <li>Knowledge of tools like <strong>GIT</strong>, <strong>Jenkins</strong>, <strong>Qt</strong> </li> <li>At least <strong>5 years</strong> of relevant <strong>working experience</strong> </li> <li>You have good communication and writing skills</li> <li>Good command of the English language</li> <li>Experience with working in teams using <strong>SCRUM</strong> </li> </ul><p><br><strong>Our offer:</strong><br> We offer you the opportunity to work in an innovative and well-equipped R&amp;D environment, which is part of a large, successful company with an excellent reputation. You will join a team of well-motivated colleagues and will have a lot of international contacts. We look forward to see you develop as a professional who creates a career in SKF and we will support your steps. Of course, our employment conditions are competitive.<br><br><strong>To apply:</strong><br> If you are interested and meet the above requirements, please apply with your CV and motivation letter via the <a href="https://ltpx.nl/nbRG9Ru" target="_blank"><strong>application form</strong></a>.<br><br><strong>About SKF:</strong><br> SKF works to reduce friction, make things run faster, longer, cleaner and more safely. Doing this in the most effective, productive and sustainable way has made the SKF Group a leading global supplier of products, solutions and services within rolling bearings, seals, mechatronics, services and lubrication systems. Services include technical support, maintenance services, condition monitoring, asset efficiency optimization, engineering consultancy and training. Visit our website <a href="https://ltpx.nl/CbTMVH4" target="_blank"><strong><a href="http://www.skf.com">www.skf.com</a></strong></a> for more information about our organization.<br><br><em>Acquistion is not appreciated.</em><img alt="" src="https://bcontrol.brockmeyer.nl/track.php?orderid=50719"></p>",
how_to_apply: "<p><a href="https://ltpx.nl/OfUILKx" target="_self">Apply here</a></p>",
company: "SKF",
company_url: "http://www.skf.com",
company_logo: "http://github-jobs.s3.amazonaws.com/03df3e84-b0f1-11e8-986e-34aa72c4fcb6.png",
url: "http://jobs.github.com/positions/06e0b540-b0f1-11e8-9a10-3d6ee608d4a1"
},
{
id: "dbfc02f2-fd77-11e3-9627-a101934ea25e",
created_at: "Tue Sep 04 18:36:22 UTC 2018",
title: "Backend Engineering (Scala+)",
location: "San Francisco",
type: "Full Time",
description: "<p>As an engineer on the Sharethrough Exchange team at Sharethrough, you’ll build out our highly scalable service infrastructure, generating insights used by top publishers and brands on the open web, powering critical revenue behind companies like Disney, CNN, VICE, and CBSi. You'll be a key contributor to our Scala-based backend services that make thousands of complex, real-time decisions per second possible. Large-scale distributed, high performance = those are the problems you can solve on the team.</p> <p><strong>What You'll Be Doing</strong></p> <ul> <li> <strong>Having a say:</strong> You’ll participate in problem definition and solution with a diverse group of engineers, designers and business owners from around the company.</li> <li> <strong>Proper engineering:</strong> Writing Scala-based pipeline processing and infrastructure that is performant, well-tested, and easy to maintain. We value teamwork and experimentation to achieve the best outcomes.</li> <li> <strong>Technical heavy lifting:</strong> You’ll architect and implement major components of an ambitious distributed system at scale.</li> </ul><p><strong>Let's Talk If</strong></p> <ul> <li> <strong>You’ve shipped software:</strong> You have production experience with large-scale distributed systems and are excited to explore new technologies that can push the boundaries of efficiency.</li> <li> <strong>You care about code:</strong> You take pride in engineering, and have a deep understanding of how to write high quality, maintainable, extensible software in a collaborative environment.</li> <li> <strong>You like moving quickly:</strong> We push to production on every commit via our continuous integration and deployment pipeline and value truly immutable infrastructure.</li> </ul><p><strong>Why You'll Love Working at Sharethrough</strong></p> <ul> <li> <strong>Values-driven culture:</strong> You’d be walking into a welcoming and diverse environment that is built around action, optimism, purpose and transparency. We have a fun, supportive culture, and firmly believe in what we’re doing.</li> <li> <strong>Marry the problem, not the solution:</strong> We’re constantly re-evaluating our technical infrastructure to deliver faster, better, and more reliable software.</li> </ul>",
how_to_apply: "<p><a href="https://jobs.lever.co/sharethrough/33855426-0ce2-47d1-8eaa-66adf6b375d2/apply?lever-source=Github">https://jobs.lever.co/sharethrough/33855426-0ce2-47d1-8eaa-66adf6b375d2/apply?lever-source=Github</a></p>",
company: "Sharethrough",
company_url: "http://Sharethrough",
company_logo: "http://github-jobs.s3.amazonaws.com/e0508206-6bc1-11e5-89ca-4c0b59d838c7.png",
url: "http://jobs.github.com/positions/dbfc02f2-fd77-11e3-9627-a101934ea25e"
},
{
id: "b8419e5e-b04b-11e8-8b2e-126cc9c7a201",
created_at: "Tue Sep 04 14:07:10 UTC 2018",
title: "PHP Software Engineer who loves DevOps",
location: "London",
type: "Full Time",
description: "<p>Our Engineering department is split into three teams, currently focusing on order fulfilment improvements (de-coupled via messaging and workers), rebuilding our core checkout as a standalone alone service (100% new code with lots of opportunities to make the best technology choices), and finally on tools to make our internal teams more efficient (more greenfield work). Teams are fairly static to give every member the chance to become a high performer.</p> <p><strong>What you'll do:</strong></p> <ul> <li>Work on high traffic APIs used by hundreds of active vendors</li> <li>Work on high traffic public-facing web application used by hundreds of thousands of customers a month</li> <li>Work on high-performance background workers for consuming queues</li> <li>Work collaboratively to design API specifications</li> <li>Practise DevOps, you’re responsible for getting your code to production and supporting it</li> <li>Use the latest cloud services available to run your code</li> <li>Write performant and well-tested code</li> <li>Build and iterate on our core products using data-driven decisions</li> <li>Help design a stable platform to support phenomenal growth</li> <li>Participate in the recruitment process: CV reviews, interviews, reviewing technical ability and cultural fit</li> <li>Be a resource for less senior Engineers to provide mentoring and coaching</li> <li>Play a part in an agile team - participate in stand-ups, sprint planning &amp; retrospectives</li> </ul><p><strong>We'd love to hear from you if:</strong></p> <ul> <li>You have competent commercial experience developing applications or other software platforms</li> <li>You have a strong understanding of the development process from design through to deployment and maintenance and what that means for day-to-day development</li> <li>Your technical skillset includes:</li> <li>Modern OOP PHP framework</li> <li>Building RESTful APis/working with PHP microservices</li> <li>Unit and behavioral testing</li> <li>SQL</li> <li>Version control systems (preferably Git)</li> <li>Exposure to another language, e.g. Ruby, Java, Obj-C, C#</li> <li>Previous exposure to JIRA</li> <li>Exposure to cloud providers (preferably AWS)</li> </ul><p><strong>Things you'll learn on the job:</strong></p> <ul> <li>Laravel 4 and Lumen (Laravel 5-based)</li> <li>AWS suite - SQS, EC2, ECS+ECR, CloudFormation, S3, RDS, Cloudwatch</li> <li>Basic UNIX system skills</li> <li>Docker containers and micro-service architecture</li> <li>Queueing for removing slower tasks from a web request</li> </ul><p><strong>Why you’ll love working at Paddle</strong></p> <p>We are a diverse team of 100 people (quickly on our way to 180+) based near London Bridge. We care deeply about enabling a great culture which is inclusive no matter your background. We celebrate our diverse group of talented employees and we pride ourselves on our transparent, collaborative, friendly and respectful culture.</p> <p>We offer a full slate of (constantly evolving) benefits, including competitive salaries, stock options, pension plans, flexible working, generous holidays and parental leaves. Plus we offer some not-so-standard, extra-fun benefits, which can include anything from joining office football team, taking up the in-office yoga lessons or enjoying a board game night. We host regular company get-togethers and quarterly socials. We have weekly catered lunches and of course, fully stocked fridges and cold brew on tap. We value learning and will help you with your personal development where we can — from constant exposure to new challenges to regular internal and external training.</p> <p><strong>About us</strong></p> <p>Our mission is to help software companies succeed — enabling them to focus on creating products the world loves. Hundreds of companies rely on our e-commerce platform to sell their software products globally, as well as our powerful analytics and marketing tools to understand and grow their businesses.</p> <p>Our vision is to become the platform that all software companies use to run and grow their business. We aim to replace a fragmented ecosystem of specialised tools with a unified platform that removes the complex burden that comes with running a software business, whilst also providing unparalleled insight to help them grow faster.</p> <p>We’re early in our journey but making great progress: Deloitte Fast 50 named us the fastest growing software company in the UK (we’ve tripled revenue every year since our launch in 2012), and we’ve raised over $17m in funding from incredible investors such as Notion, BGF and Kindred.</p> <p><strong>Equal opportunities</strong></p> <p>We believe in having diverse teams in which everyone can be their authentic self is key to our success. We encourage people from underrepresented backgrounds to apply and we don't discriminate based on race, colour, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, marital status, disability or age. Our office is wheelchair friendly and we are a family-friendly employer.</p> <p>Come join us, and find out what the best work of your career could look like for you!</p> <p><a href="https://paddle.com/careers/">Why Join Paddle?</a></p>",
how_to_apply: "<p><a href="https://boards.greenhouse.io/paddle/jobs/4024723002?gh_jid=4024723002">https://boards.greenhouse.io/paddle/jobs/4024723002?gh_jid=4024723002</a></p>",
company: "Paddle",
company_url: "http://www.paddle.com",
company_logo: "http://github-jobs.s3.amazonaws.com/b0105f86-b04b-11e8-98e6-3833dc9e6f60.png",
url: "http://jobs.github.com/positions/b8419e5e-b04b-11e8-8b2e-126cc9c7a201"
},
{
id: "e6e8548a-b043-11e8-96fc-d82a5d1fe8bb",
created_at: "Tue Sep 04 13:10:48 UTC 2018",
title: "Information Security Architect",
location: "Liverpool",
type: "Full Time",
description: "<p><b>Information Security Architect</b> <br></p> <p><b>Job Purpose</b><br> Provide strategic security capability for the Group, including collaborating with key stakeholders to develop, implement and maintain the Information/IT Security Programme, ensuring information assets and operations are secured effectively. Identify, evaluate and report on information security risks, threats and vulnerabilities including identifying strategies to meet compliance with ISO 27001, General Data Protection Regulation (GDPR) and Payment Card Industry Data Security Standards (PCI DSS) as well as customer and regulatory requirements.<br></p> <p><b>Accountabilities or “What You Have to Do”</b><br></p> <p>• Collaborate with key stakeholders, including the Information Security Technical Lead, Enterprise and Solutions Architects and Project Management team to develop, implement and maintain the Group’s Information/IT Security Programme, ensuring alignment with the Group’s risk appetite and information assets and operations are secured effectively<br> • Contribute to Group projects, including working closely with Solutions and Enterprise Architects, to ensure security is in the design across all domains including the implementation of Secure by Design principles where appropriate.<br> • Provide industry knowledge and expertise to senior stakeholders, including Executive Directors, and leading edge technology thinking on behalf of assigned business domains to influence the Group’s future technology investments.<br> • Contribute to requirement gathering for bid work, providing security architecture expertise to ensure compliance with security standards.<br> • Research, identify, analyse and act as decision maker for high-level IT Security solutions across the Group, ensuring cost effectiveness and assurance and the ongoing influencing of the Group’s IT strategy and roadmap.<br> • Analyse business strategies, plans and key decisions as required, to identify Information IT/Security risks and implications, outlining issue resolution requirements and providing ad-hoc reports as appropriate.<br> • Oversee security architecture through to design, implementation and operations ensuring ISO 27001 and GDPR compliance.<br> • Contribute to the development of data protection methodologies, cryptography key and certificate management requirements and network security architecture for the Group, ensuring data security standards and compliance requirements are maintained.<br> • Influence key decisions at a senior level including multi million pound Capital budget spend for large-scale future IT Security technology investments made by the Group, ensuring technical information is successfully presented, discussed and understood by non-technical audiences, including Executive Directors.<br> • Ensure alignment of proposed IT solutions with the most appropriate IT Security architecture and practices to support business plans and strategies and overall alignment with the Group’s strategic objectives.<br> • Maintain industry knowledge of technologies and potential suppliers, ensuring the most appropriate, cost effective solutions are identified to support the delivery of business objectives, or those that could enable new business opportunities.<br> • Provide recommendations on security improvement strategies to existing application, data and infrastructure architectures in area(s) of expertise, to ensure continuous improvement and maximise technologies for the Group.<br> • Maintain an in-depth understanding of IT Security protocols, solutions and emerging trends, including how to contribute IT security as an enabler, to ensure the implementation of new and improved technologies across the business, projects, networks and applications<br> • Actively participate in any IT design authority boards/forums ensuring adherence to the Group’s architecture and design principles and standards for all projects within any assigned domains, contributing expertise on how best to secure and maintain security in future designs.<br> • Provide leadership, direction and expertise at all levels to ensure business objectives and security requirements work harmoniously together to protect information assets, data leakage exposure and breach incidents.<br> • Contribute to and sign-off solution designs alongside IT Architects and Project Team members, supporting the end-to-end IT solution definition for complex initiatives/projects to ensure alignment of business security needs, strategic objectives and realisation of critical dependencies.<br> Contribute to the continuous improvement of processes and procedures.<br> • Ensure that all information security requirements, including data protection, are met in accordance with the Group’s policy, procedures and statutory requirements.<br> • Ensure that health and safety requirements are met in accordance with the Group’s policy, procedures and statutory requirements.<br> • Respond flexibly to any necessary changes in work priorities and undertake other duties when required to support the effective operation of the service.<br></p> <p><b>Knowledge, Skills and Experience</b><br></p> <p>Essential<br></p> <p>• Proven track record of successfully delivering IT security solutions across multiple domains.<br> • Expertise in IT security architecture across multiple technologies (application, data or infrastructure) with broad knowledge of security threats, vulnerabilities and controls.<br> • Proven ability to develop and maintain personal IT Security architectural knowledge, skills and abilities.<br> • Certification in an IT Security Architecture related subject<br> • Experience of delivering IT roadmaps on time with security features for specific business or technology areas for a large organisation.<br> • Experience of acting in an ever improving security culture adapting quickly and responding promptly to security projects embedded within multiple on-going business projects.<br> • Experience of IT security architecture tools and techniques.<br> • Experience of working with multiple, diverse technologies and processing environments.<br> • Evidence of effective stakeholder management, including at a senior level, both internally and external to the organisation.<br> • Experience of working with multiple delivery techniques including traditional structured (waterfall) Agile, TOGAF (The open group architecture framework) and COBIT (Control objectives for information and related technology).<br> • Effective negotiation skills and the ability to successfully persuade and influence others.<br> • Customer focused with excellent written and verbal communication skills, with the ability to work at all levels within the business.<br> • Ability to show initiative and propose security solutions to issues identified.<br> • Results focussed with the ability to take ownership of tasks.<br> • Commercially aware with a focus on continuous improvement.<br> • Experience of successfully coaching and mentoring less experienced colleagues.<br> • Excellent team player who can work flexibly to meet business requirements. <br></p> <p>Desirable<br> • Degree qualification in a relevant subject, or equivalent.<br> • Worked on large scale security projects with track record of security architecture implementations.<br></p> <p><b>Competency Framework</b><br></p> <p>• <b>Deliver the Vision</b><br> Focuses on the company's goals, understands its direction and contributes to its overall success.<br> • <b>Focus on Performance</b><br> Takes ownership of the performance and development of themselves, supports the development of others.<br> • <b>Strive for Excellence</b><br> Continually looks for ways to improve the service provided by self, team and the organisation.<br> • <b>Be Commercially Minded</b><br> Aware of the need to add value to support economic, sustainable growth for the organisation.<br></p> <p><b>Additional Information</b><br></p> <ul> <li>The Group has offices across the UK and on this basis, there may be the requirement to travel to other locations to effectively perform this role.<br> </li> <li>The role will be exposed to sensitive information, therefore the role holder is expected to maintain levels of confidentiality at all times.<br> </li> <li>The role holder is expected to be committed to equal opportunities and to promote nondiscriminatory practices in all aspects of work undertaken.<br> </li> </ul><p><b>Interested?</b><br> Apply now by using the application form.<br></p> <p><a href="https://riverside.redirect.your-jobresponse.com/information_security_architect_liverpool/225473/V819/apply">Click here for the application form</a><br></p> <p><b>Agency calls are not appreciated.</b><br></p>",
how_to_apply: "<p><a href="https://riverside.redirect.your-jobresponse.com/information_security_architect_liverpool/225473/V819/apply">Click here for the application form</a><br></p>",
company: "Riverside",
company_url: "https://www.riverside.org.uk/",
company_logo: "http://github-jobs.s3.amazonaws.com/16851872-b044-11e8-9cba-146ec6c0371d.jpg",
url: "http://jobs.github.com/positions/e6e8548a-b043-11e8-96fc-d82a5d1fe8bb"
},
{
id: "89d3c400-b039-11e8-94c1-0a9a08efe804",
created_at: "Tue Sep 04 11:58:18 UTC 2018",
title: "Full Stack Web Developer (m/f)",
location: "Berlin",
type: "Full Time",
description: "<p>Free2Move is one of the most exciting projects of the sharing economy. We are a subsidiary of PSA Group and the central column in PSA’s strategy to transform from a classic car manufacturer to a mobility provider.Today we offer our service in 10 different countries in Europe and the U.S. International providers such as car2go, COUP, Drivy and many local ones such as Flinkster, Share'ngo, and Autolib are part of our service. Even as we grow rapidly and add new providers with every update, we still have the revolutionary spirit that got us here.Our goal is to offer you a mobility guarantee, no matter where you are when you need it and where you want to go. For us, this is the essence of unlimited mobility.</p> <p>Our Web stack uses a wide variety of solutions - from static pages, SPAs and CMSs to self-written middlewares and full-featured APIs.</p> <p>We are looking for an experienced software engineer who is able to build solid software in the web universe. Requirements</p> <p>We really would like to get in touch with you if:</p> <ul> <li>You love JavaScript and have a good knowledge in writing middleware and designing APIs</li> <li>You have a good understanding of your server environment</li> <li>You are capable of making architectural decisions that will result in scalable, reliable, and performant code and systems</li> <li>You are enthusiastic about new language features and know why to use them</li> <li>You have practical experience with build automation, continuous delivery, scripting, etc.</li> <li>You have hands-on knowledge of developing applications on AWS and Kubernetes (incl. Docker)</li> <li>You feel at home with relational (e.g. PostgreSQL) and non-relational databases (e.g. MongoDB)</li> <li>You want to make our stack better: We’re always happy to see faster builds, more automation, cleaner code, higher test coverage and other goodies</li> <li>You don't run away from documenting services under your supervision</li> <li>You believe in agile processes and lean startup principles</li> <li>You can accompany a feature from idea to realisation by collaborating with other teams and team members</li> <li>You dare to suggest solutions because they fit best to the requirements</li> <li>You are a team player and you're able to give as well as receive feedback</li> </ul><p>Also nice to have:</p> <pre><code>Experience in some frameworks like Express/koa Familiarity with the ELK stack Experience in working with service meshes, API gateways, service directories and similar technologies that make working with microservices a bit less painful Some knowledge in developing frontends (esp. React/Angular) </code></pre> <p>At Free2Move we offer:</p> <p>...Open company structure with flat hierarchies</p> <p>...An international team coming from all over the world</p> <p>...Being part of the most exciting projects of the sharing economy</p> <p>...Opportunity to grow your own ideas</p> <p>...Cool loft office in the heart of Berlin</p> <p>...Competitive salary matching your experience and skills</p> <p>...A buddy system that helps you settle in</p> <p>...free carsharing!</p> <p>Sounds like you? Apply now! We are very much looking forward to getting to know you.</p>",
how_to_apply: "<p><a href="https://jobs.free2move.com/o/full-stack-web-developer-mf-7/c/new">https://jobs.free2move.com/o/full-stack-web-developer-mf-7/c/new</a></p>",
company: "Free2Move / GHM Mobile Development GmbH",
company_url: null,
company_logo: null,
url: "http://jobs.github.com/positions/89d3c400-b039-11e8-94c1-0a9a08efe804"
},
{
id: "5958b9ca-9419-11e8-9342-3f78d5254cc6",
created_at: "Tue Sep 04 11:49:40 UTC 2018",
title: "Senior Software Engineer (C++)",
location: "Remote",
type: "Full Time",
description: "<p>We created Sticker Mule to be the best place to work and shop. That means making ordering fast, simple and fun while creating a stable, low stress and enjoyable place for talented people to work.</p> <p><br>We're searching for more to join us as we look to build one of the Internet's best technical teams. Some of our current projects include migrating to a service architecture, inter-service communication with GCloud PubSub and GRPC, API Gateway based GraphQL, event sourcing persistence and CQRS, and manufacturing and artwork processing automation.</p> <p><a href="https://www.stickermule.com/about">See more about our teams here</a></p> <p><strong>Why we enjoy working here</strong> <br>1. We work flexible hours with an asynchronous culture. <br>2. We work at a sustainable pace without unreasonable external deadlines. <br>3. Varied, interesting technical challenges to work on. <br>4. Opportunities to make a large impact as part of a small, highly motivated team.</p> <p><strong>Our tech stack</strong> <br>1. Backend: Ruby on Rails, NodeJS, Go <br>2. DB: Aurora/Mysql, Postgres, Redis <br>3. Frontend: React, Redux, Webpack <br>4. APIS: GraphQL, GRPC, GCloud PubSub <br>5. AWS, migrating to Gcloud <br>6. Docker, Kubernetes</p> <p><strong>What you'll do</strong> <br>1. You’ll be responsible for writing and maintaining software critical to our automated manufacturing process <br>2. Continually seek ways to optimize those processes. <br>3. Write clean, performant code in accordance with our team’s code style guidelines. <br>4. Work to improve and maintain the code health of all our software. <br>5. Collaborate with other developers, team leads and stakeholders to ensure that we’re always building the optimal solution. <br>6. Participate in peer code reviews. <br>7. Share expertise with other members of the team, mentor junior developers. <br>8. Spend some time on-site at our factory to learn about software requirements and maintain existing software.</p> <p><strong>About you</strong> <br>1. You have a minimum of 3 years professional software development experience. <br>2. You’re highly competent in multiple general purpose languages. C++ and Ruby would be especially beneficial. <br>3. You’re confident in mathematics relevant to computer graphics. <br>4. Experience with the following would be highly beneficial. <br>-Printing and related issues like color management. <br>-Vector and raster graphics generation and manipulation. <br>5. Familiarity with QT would be beneficial. <br>6. You are experienced in using and building web services. <br>7. You possess strong analytical and critical thinking skills. <br>8. You have great written and verbal communication skills in English.</p> <p><strong>Compensation</strong> <br>1. $90,000-$115,000+ depending on experience <br>2. Signing bonus <br>3. 28 days vacation</p> <p><strong>Requirements</strong> <br>1. This position requires regular visits to our manufacturing facilities in upstate NY. <br>2. Must be located within reasonable travel distance to upstate NY or Pisa, Italy. <br>3. Applicants will be sent a Hackerrank test within 1-2 business days of applying. <br>4. Test must be completed within 5 business days.</p>",
how_to_apply: "<p>Apply here only: <a href="https://www.stickermule.com/career/df523075-edca-4b4c-9d6c-984502a600cc">https://www.stickermule.com/career/df523075-edca-4b4c-9d6c-984502a600cc</a></p>",
company: "Sticker Mule",
company_url: "http://Sticker Mule",
company_logo: "http://github-jobs.s3.amazonaws.com/e4b4f076-9417-11e8-8fdd-f9750d1d7982.png",
url: "http://jobs.github.com/positions/5958b9ca-9419-11e8-9342-3f78d5254cc6"
},
{
id: "992cc16c-b035-11e8-8b93-1242061a73d7",
created_at: "Tue Sep 04 11:29:42 UTC 2018",
title: "(Senior) iOS Developer (m/f)",
location: "Berlin",
type: "Full Time",
description: "<p>Free2Move is one of the most exciting projects of the sharing economy. We are a subsidiary of PSA Group and the central column in PSA’s strategy to transform from a classic car manufacturer to a mobility provider.Today we offer our service in 10 different countries in Europe and the U.S. International providers such as car2go, DriveNow, COUP, Drivy and many local ones such as Flinkster, Share'ngo, and Autolib are part of our service. Even as we grow rapidly and add new providers with every update, we still have the revolutionary spirit that got us here.Our goal is to offer you a mobility guarantee, no matter where you are when you need it and where you want to go. For us, this is the essence of unlimited mobility. We can't wait to continue that journey with you.</p> <p>Your Tasks</p> <ul> <li>Build and shape the best international carsharing aggregator app </li> <li>Focus on the user experience and iOS best practices</li> <li>Deploy modern development techniques, promote deep iOS integration</li> <li>Evaluate the newest UX/UI concepts on top of our app features</li> <li>Coordinate the overall iOS development together with the iOS Team and other departments of Free2Move</li> <li>Help the iOS team grow their knowledge of development in general and the iOS stack in particular</li> <li>Coordinating the improvements of the app in terms of code quality, stability, robustness and testability</li> <li>Collaborate with cross-functional teams to define, design, and ship exciting new features</li> <li>Continuously discover, evaluate, and implement new technologies to maximize development efficiency</li> </ul><p>Your Profile</p> <ul> <li>Profound knowledge and experience with iOS and watchOS SDK</li> <li>UX/UI driven sense of application design</li> <li>Solid experience with client/server communication</li> <li>Fluent knowledge of Objective-C, optionally Swift</li> <li>Profound knowledge and experience with development paradigms like Design Patterns, Clean Code, Agile Development, Unit Testing</li> <li>Deep knowledge and experience with the specifics of mobile development</li> <li>Teamplayer and Tech leadership skills</li> </ul><p>What we offer:</p> <p>...Open company structure with flat hierarchies</p> <p>...An international team coming from all over the world</p> <p>...Being part of the most exciting projects of the sharing economy</p> <p>...The Opportunity to grow your own ideas</p> <p>...Cool loft office in the heart of Berlin</p> <p>...Competitive salary matching your experience and skills</p> <p>...free carsharing!</p> <p>Sounds like you? Apply now, we are looking forward to getting to know you!</p>",
how_to_apply: "<p>Apply directly here: <a href="https://jobs.free2move.com/o/senior-ios-developer-mf-1-10/c/new">https://jobs.free2move.com/o/senior-ios-developer-mf-1-10/c/new</a></p>",
company: "Free2Move / GHM Mobile Development GmbH",
company_url: null,
company_logo: "http://github-jobs.s3.amazonaws.com/fed47318-b033-11e8-9a87-65170b5ed3d4.png",
url: "http://jobs.github.com/positions/992cc16c-b035-11e8-8b93-1242061a73d7"
},
{
id: "c11176d8-b02a-11e8-8ec4-45844f375fb3",
created_at: "Tue Sep 04 10:10:48 UTC 2018",
title: ".NET Developer",
location: "Capelle aan den IJssel",
type: "Full Time",
description: "<p><i>Our ICT department is fully engaged in the further development of our b2b website and the corresponding API. Do you have .NET experience and are you able to deliver a good end product? Then read on for the function of: </i><br></p> <p><b>Experienced .NET Developer</b><br><i>HBO level</i><br><i>full time (40 hours a week)</i><br></p> <p><b>The function</b><br> As a .NET Developer you will be working in a Scrum team, contributing to development and maintenance of our website.<br></p> <p><b>Your duties and responsibilities</b><br></p> <ul> <li>Assessing the feasibility of the requirements and the development effort<br> </li> <li>Developing, documenting and testing software and interfaces<br> </li> <li>Delivering software within budget and time and deploying realized solutions<br> </li> </ul><p><b>We ask</b><br></p> <ul> <li>HBO working and thinking level<br> </li> <li>At least 3 years of experience as a .Net developer<br> </li> <li>Creativity<br> </li> <li>Knowledge of/experience with at least some of Angular &gt; 2, Typescript, CSS, C#, Dependency injection, Azure<br> </li> <li>Willingness to work weekend and evening shifts (on an occasional basis)<br> </li> <li>English speaking (and Dutch, if possible)<br> </li> </ul><p>To make this role a success, you have the following competencies: positive critical attitude, ambitious and eager to learn, interest in music, great sense of responsibility (it is a core application of the organization), communicative skills, stress resistant, strong analytical skills and you can work independently and in a team. <br></p> <p><b>We offer</b><br></p> <ul> <li>A varied job with flexible working hours<br> </li> <li>Informal company with a "Rotterdam" mentality where music is an important part of<br> </li> <li>A profit-sharing scheme and good other terms of employment (including 13th month)<br> </li> <li>Working with Scrum<br> </li> <li>Working on latest technologies<br> </li> </ul><p><b>About us</b><br> Bertus Groothandel &amp; Distributie B.V., started in 1971 as a record store, has grown into an international wholesaler and distributor of CDs, DVDs and vinyl with more than 190 employees. We deliver in every genre and are focused on music stores worldwide. In addition, promotion and marketing for exclusive (distribution) labels is an important activity in a large part of Europe. The organization is characterized by an informal atmosphere where music is for many people their hobby, which you will find in everyone's office. Our IT department consists of 13 people, including 8 software developers.<br></p> <p><b>Does this function appeal to you or do you know someone who is interested?</b> <br> Send your application and motivation letter before 28 september 2018 to Miranda Veldhoen, HR Manager via the application form.<br></p> <p><a href="https://bertus.heeft-vacatures.nl/net_developer_capelle_aan_den_ijssel/225427/V819/solliciteren">click here for the application form!</a><br></p> <p>For any questions you can contact team leader Huibert Kaat, via 010-2641500. For more information about Bertus Groothandel &amp; Distributie B.V. at <a href="http://www.bertus.com">http://www.bertus.com</a>.<br></p>",
how_to_apply: "<p><a href="https://bertus.heeft-vacatures.nl/net_developer_capelle_aan_den_ijssel/225427/V819/solliciteren">click here for the application form!</a><br></p>",
company: "Bertus Groothandel & Distributie B.V.",
company_url: "http://www.bertus.com",
company_logo: "http://github-jobs.s3.amazonaws.com/b2a80d82-b02a-11e8-997f-63a64593de13.jpg",
url: "http://jobs.github.com/positions/c11176d8-b02a-11e8-8ec4-45844f375fb3"
},
{
id: "39cf87b2-b027-11e8-8008-4d323ee42df7",
created_at: "Tue Sep 04 09:50:37 UTC 2018",
title: "Software Engineer - Berlin",
location: "Berlin",
type: "Full Time",
description: "<p>We are The Mobile Bank. Our vision is to build a bank the world loves to use. Technology and design empower everything we do.</p> <p>N26 is Europe’s first Mobile Bank with a full European banking license. We redesigned the banking experience to be simple, fast and contemporary. Founded in 2013 by Valentin Stalf and Maximilian Tayenthal, N26 has more than 430+ employees and more than 1 million customers in 17 countries. N26 has raised more than $215 million from renowned investors including Allianz X, Tencent Holdings Limited, Li Ka-Shing’s Horizons Ventures, Peter Thiel’s Valar Ventures, members of the Zalando management board and Earlybird Venture Capital.</p> <p><strong>Once here you will</strong></p> <ul> <li>Develop software using Java 8 with Spring Boot and Kotlin.</li> <li>Be able to manage individual project priorities, deadlines and deliverables.</li> <li>Continuously improve your skills by taking the initiative to learn and share your knowledge with others.</li> <li>Within cross-functional teams you collaborate towards building scalable products.</li> </ul><p><strong>What you will bring along</strong></p> <ul> <li>You have experience developing software in Java 8 related technologies.</li> <li>You are familiar with the concept of microservice architecture. You are known as a person who does not shy away from a tough problem.</li> <li>Because you know technology keeps evolving, you stay up to date with the current trends in software design.</li> <li>We are an international company and therefore English professional proficiency is a must.</li> </ul><p><strong>What we offer</strong></p> <ul> <li>Working with international, highly engaged peers</li> <li>Freedom to prototype given the challenges we face</li> <li>Getting things done attitude</li> <li>Flat hierarchy and open communication</li> <li>Exciting Challenges</li> <li>Personalized Onboarding</li> <li>Interesting technical problems to solve as we scale</li> <li>Working with engaged, smart engineers</li> </ul><p>Find a career path. Not just a job. Some of our benefits and rewards can be found on our careers website.</p>",
how_to_apply: "<p>Sound good? Send us your application online, and we’ll get back to you soon: <a href="https://grnh.se/3a9b921d1">https://grnh.se/3a9b921d1</a></p>",
company: "N26",
company_url: "https://n26.com/",
company_logo: "http://github-jobs.s3.amazonaws.com/e013d936-b052-11e8-88e6-130b5e4cf658.png",
url: "http://jobs.github.com/positions/39cf87b2-b027-11e8-8008-4d323ee42df7"
},
{
id: "3f7377be-b027-11e8-962d-34eb92a7af81",
created_at: "Tue Sep 04 09:49:52 UTC 2018",
title: "Software Engineer - Barcelona",
location: "Barcelona",
type: "Full Time",
description: "<p>We are The Mobile Bank. Our vision is to build a bank the world loves to use. Technology and design empower everything we do.</p> <p>N26 is Europe’s first Mobile Bank with a full European banking license. We redesigned the banking experience to be simple, fast and contemporary. Founded in 2013 by Valentin Stalf and Maximilian Tayenthal, N26 has more than 430+ employees and more than 1 million customers in 17 countries. N26 has raised more than $215 million from renowned investors including Allianz X, Tencent Holdings Limited, Li Ka-Shing’s Horizons Ventures, Peter Thiel’s Valar Ventures, members of the Zalando management board and Earlybird Venture Capital.</p> <p><strong>Once here you will</strong></p> <ul> <li>Develop software using Java 8 with Spring Boot and Kotlin.</li> <li>Be able to manage individual project priorities, deadlines and deliverables.</li> <li>Continuously improve your skills by taking the initiative to learn and share your knowledge with others.</li> <li>Within cross-functional teams you collaborate towards building scalable products.</li> </ul><p><strong>What you will bring along</strong></p> <ul> <li>You have experience developing software in Java 8 related technologies.</li> <li>You are familiar with the concept of microservice architecture. You are known as a person who does not shy away from a tough problem.</li> <li>Because you know technology keeps evolving, you stay up to date with the current trends in software design.</li> <li>We are an international company and therefore English professional proficiency is a must.</li> </ul><p><strong>What we offer</strong></p> <ul> <li>Working with international, highly engaged peers</li> <li>Freedom to prototype given the challenges we face</li> <li>Getting things done attitude</li> <li>Flat hierarchy and open communication</li> <li>Exciting Challenges</li> <li>Personalized Onboarding</li> <li>Interesting technical problems to solve as we scale</li> <li>Working with engaged, smart engineers</li> </ul><p>Find a career path. Not just a job. Some of our benefits and rewards can be found on our careers website.</p>",
how_to_apply: "<p>Sound good? Send us your application online, and we’ll get back to you soon: <a href="https://grnh.se/57a7ad2a1">https://grnh.se/57a7ad2a1</a></p>",
company: "N26",
company_url: "https://n26.com/",
company_logo: "http://github-jobs.s3.amazonaws.com/08358928-b053-11e8-9d5d-d2e59a8f2a4e.png",
url: "http://jobs.github.com/positions/3f7377be-b027-11e8-962d-34eb92a7af81"
},
{
id: "8ee4f772-afa6-11e8-917f-563a072f2314",
created_at: "Mon Sep 03 18:24:40 UTC 2018",
title: "Python Engineer with a Data Focus",
location: "Any (work from home!)",
type: "Full Time",
description: "<p>​​​Are you a top-notch Python engineer with a keen eye for data? If so, we need to talk!</p> <p>We're a fast growing startup looking for a strong Python engineer who can help us build scalable software around our data services. The apps you will build will make a real difference in thousands of peoples lives and will help local governments address their challenges around short-term rentals like Airbnb while making it easy for short-term rental hosts play by the rules.</p> <p>​​​Key Responsibilities:</p> <ul> <li><p>Build easy to use scalable software that makes a difference in the lives of thousands of users and citizens</p></li> <li><p>Wire up front-end &amp; backend services to be used by data analysts, citizens and government officials</p></li> <li><p>Expand our reporting and analytics tools</p></li> <li><p>Independently produce well-crafted reports, with an eye to detail to ensure that the report is both accurate and valuable.</p></li> <li><p>Write performant SQL queries and optimize existing queries.</p></li> <li><p>Contribute to our core Python code base​</p></li> </ul><p>To be successful in this role you must be a person who thrives in an extremely fast-paced environment. We solve hard problems on tight deadlines and release multiple times per week</p> <ul> <li>5 years of hands-on experience with Python</li> <li>A passion for fast-paced development and weekly or daily releases</li> <li>Experience with Agile / Scrum development processes</li> <li>Fluency with: &gt;Python &gt;Postgres ​ &gt;SQLAlchemy &gt;Ubuntu &gt;AWS​ &gt;JavaScript/AngularJS</li> </ul><p>Nice-to-Haves:</p> <ul> <li>3+ years of “in the trenches” startup experience</li> <li>Experience working with a distributed software engineering team</li> <li>Experience with: ​ &gt;Flask &gt;Pandas &gt;PostGIS &gt;Jupyter notebook​ &gt;Third-Party Services like: &gt;Google APIs &gt;Lob &gt;Webmerge &gt;Twilio &gt;Zapier​​​</li> </ul>",
how_to_apply: "<p><a href="https://host-compliance-llc.breezy.hr/p/71293f2e4759-python-engineer-with-a-data-focus">https://host-compliance-llc.breezy.hr/p/71293f2e4759-python-engineer-with-a-data-focus</a></p>",
company: "Host Compliance",
company_url: "https://hostcompliance.com",
company_logo: "http://github-jobs.s3.amazonaws.com/7886b22c-afa6-11e8-810a-965969e69a20.png",
url: "http://jobs.github.com/positions/8ee4f772-afa6-11e8-917f-563a072f2314"
},
{
id: "4fcff774-afa3-11e8-93a4-6108a937a0b2",
created_at: "Mon Sep 03 18:03:08 UTC 2018",
title: "iOS Software Engineer (with Networking Experience)",
location: "Philadelphia",
type: "Full Time",
description: "<h2>iOS Software Engineer Position</h2> <p><strong>Trinity Mobile Networks is seeking an iOS Software Engineer with a strong technical background,</strong> excellent team skills, and relevant experience in the field. A successful candidate will be dedicated to ensuring our iOS Application continues to perform well on many types of devices. In addition, candidates will have an interest in optimization, testing, and expansion of our feature set. Our products and their reach are rapidly growing, so a successful candidate should be flexible, innovative, and dedicated.</p> <p>Exemplary engineering candidates are experienced and willing to work within <strong>iOS’s VPN/networking APIs</strong>. They would be familiar with <strong>socket-based programming, networking and network connectivity APIs</strong>. The candidate should also be well-versed in core iOS APIs related to application lifecycle, background services, and UI.</p> <p>This role requires experience with <strong>building / testing / maintaining iOS applications in Swift.</strong> Priority will be given to candidates with a <strong>strong background in C/C++.</strong></p> <p><strong>An ideal candidate would have experience with:</strong></p> <ul> <li> optimizing, building, testing, and maintaining iOS Apps</li> <li> socket programming</li> <li> VPNs</li> <li> Networking+connectivity APIs</li> </ul><p>Preference will be given to candidates based in, or willing to relocate to Philadelphia and for logistical reasons we will be primarily considering applicants in timezones within +/- 3-4 hrs of UTC-4/ EST. When applying, please be specific about your experience relevant to this position and Trinity Mobile Networks.</p> <h2>About Trinity Mobile Networks</h2> <p>Trinity Mobile Networks is at the bleeding edge of IP Network technology. Our overlay software-defined networking platform, Jumpnet, makes cellular and WiFi networks appear to end users as a single high-capacity, inexpensive, and ubiquitous network. We enable channel bonding, seamless handoffs, mesh connections, multi-path transmissions, and provide an Always Best Connected service.</p> <p>Jumpnet helps network operators control their network and offload traffic to Wi-Fi hotspots while also improving subscriber quality of experience. Our platform virtualizes all of a device's connections and aggregates connection-states across the network. This provides network operators with a unified view of the entire network topology and detailed analytics.</p>",
how_to_apply: "<p>To apply email your resume to hiring@trinitymobilenetworks.com. When applying, please be specific about your experience relevant to this position and Trinity Mobile Networks. Please also include your location.</p>",
company: "Trinity Mobile Networks",
company_url: "http://trinitymobilenetworks.com",
company_logo: "http://github-jobs.s3.amazonaws.com/25246b9a-afa3-11e8-9768-150688bf4244.png",
url: "http://jobs.github.com/positions/4fcff774-afa3-11e8-93a4-6108a937a0b2"
},
{
id: "7936b81c-af7d-11e8-9f5e-472cb44db4ff",
created_at: "Mon Sep 03 13:33:01 UTC 2018",
title: "DevOps Engineer",
location: "Rotterdam",
type: "Full Time",
description: "<p><i>Are you a DevOps or Systems Engineer who can’t wait to make actual impact and be part of a growing engineering team? Seek no more, VONQ offers it all! We do cool stuff, like building a flagship product, tools and APIs that serve global customers. Are you up for the challenge? Apply at VONQ and make things happen!</i></p> <p><b>DevOps / Systems Engineer</b><br><i>Rotterdam, fulltime position (32 - 40), ASAP</i></p> <p><b>Life as a DevOps / Systems Engineer at VONQ’s Engineering team</b><br> Let’s start by saying that you will be leading critical platform development efforts and get your hands dirty in the design, implementation and testing of various infrastructure services that are used by our development teams.</p> <p>We are a growing (engineering) organisation. We have a team of 15 Engineers, and we’re not done growing yet! Our goal is to get our development process, infrastructure and engineering practices to the next level. How we are going to make this happen? We will start to utilise a number of various DevOps practices. And that’s where you come in!</p> <p>We are looking for an engineer that can (help) make the change happen. You'll be working closely with our CTO and our product development teams. Your part in this process? You’ll be contributing to the platform that runs our flagship product called Job Marketing Platform (JMP). It’s a (big) data-driven application with a recommendation engine to serve multiple personas. The whole platform is build up by multiple services and our stack includes: PHP, Mysql, RabbitMQ, Mongo, Spark, Elasticsearch, Scala.</p> <p><b>What you’ll actually do</b><br></p> <ul> <li>Make fully functional environments available on demand for the development team<br> </li> <li>Provide guidance and support on application architecture as we move to a container based architecture<br> </li> <li>Ensure a smooth flow of work for all of our development teams<br> </li> <li>Enable fast clear feedback for our development team (and the wider business) on application changes, by providing clear logging, metrics and supporting the team's automated testing infrastructure<br> </li> <li>You will work autonomously to make our architectural and business goals a reality<br> </li> </ul><p><b>What we need</b><br><i>This describes the ideal candidate, but above all we value people that have an appetite to excel, and the potential to succeed.</i><br></p> <ul> <li>Bachelor degree or equivalent relevant work experience<br> </li> <li>Excellent communication skills in English<br> </li> <li>You are able to work autonomously and support the goals of the development team with a good understanding of software development processes and agile methodology<br> </li> <li>Experience working in application development, systems or IT operations<br> </li> <li>Experience with Cloud and container technologies (e.g. AWS, docker, rocket)<br> </li> <li>Great understanding Devops practices and why to use them (e.g. CI,CD, Infrastructure as code, automated testing)<br> </li> <li>You can develop an array of tools using various programming languages (e.g. Golang, Python, PHP, Scala)<br> </li> <li>Experience with at least some of our middleware and databases: NGINX, Elasticsearch, RabbitMQ, MySQL, Mongo<br> </li> <li>Experience in contributing to the systems architecture of a company<br> </li> </ul><p>Apart from that you are not afraid to get your hands dirty on older infrastructure, to maintain it and migrate it to the new environment. Working in an Agile development environment (Scrum/Kanban) is something you’ve done before. Last, you have a bunch of enthusiasm and you love to bring new ideas to the table and share your knowledge with the team!</p> <p><b>Bonus points</b><br></p> <ul> <li>Experience with application development (e.g. PHP, Scala, Ruby, Golang)<br> </li> <li>Experience with data engineering (e.g. spark, scala, databricks)<br> </li> <li>Worked as part of a distributed (or international) team<br> </li> </ul><p><b>What’s in it for you</b><br> First of all, you’ll be working with experienced colleagues with a strong vision on web development and software architecture, giving you a full intellectual challenge every day. Secondly you will be part of a vibrant and ambitious team of 12 different nationalities in a very casual environment. Thirdly, you'll have the opportunity to participate in meetups/conferences.</p> <p>We often have a BBQ (and beers) on our terrace at the office and multicultural potluck lunches. Oh.. and you will have fun!</p> <p><b>What’s more</b><br></p> <ul> <li>Laptop of your preferences and two extra screens on your desk<br> </li> <li>Flexible working hours<br> </li> <li>Unlimited holiday’s<br> </li> <li>Good salary and additional incentives<br> </li> <li>Commuting expenses compensation<br> </li> <li>Time and budget for training<br> </li> <li>Fixed term contract with an option for perm<br> </li> <li>Plenty of whiteboards and sticky notes in our office!<br> </li> </ul><p><b>Are you up for the challenge?</b> Apply by clicking on <a href="https://vonq.redirect.your-jobresponse.com/devops_engineer_rotterdam/201779/V819/apply">this link</a> . Still have questions left? Contact Sarah (Recruiter) -&gt; sarahellithy(at)vonq.com.</p>",
how_to_apply: "<p><a href="https://vonq.redirect.your-jobresponse.com/devops_engineer_rotterdam/201779/V819/apply">click here for the application form!</a></p>",
company: "Vonq",
company_url: null,
company_logo: "http://github-jobs.s3.amazonaws.com/63aeffc2-af7d-11e8-867a-228b86f3f1f7.jpeg",
url: "http://jobs.github.com/positions/7936b81c-af7d-11e8-9f5e-472cb44db4ff"
},
{
id: "1fce6c70-af5f-11e8-9feb-2087c445908f",
created_at: "Mon Sep 03 09:53:39 UTC 2018",
title: "(Senior) Software Engineer - .NET and C# - 32/40hrs",
location: "Utrecht",
type: "Full Time",
description: "<p><strong>(Senior) Software Engineer - .NET and C# - 32/40hrs</strong><br><br> As Senior Software Engineer .NET and C#, you are a member of our DevOps scrum team. You are responsible for building our innovative solutions. You help to outline new enterprise applications and think actively, in collaboration with the team, about software design and technical solutions. Furthermore, you have your own ideas about architecture and are not afraid to share your knowledge.<br><br> A fullstack Developer at FRISS is eager to grow, not afraid to take chances and thinks out-of-the-box. You combine this with excellent knowledge of C# and JavaScript, our main languages, through which you create new possibilities and advantages.<br><br><strong>Our job</strong><br> By keeping an eye on the latest insights and trends, you have your own say in how products of FRISS can be optimized and used at our clients. You apply quality improvement processes like unit testing, code reviews and continuous delivery and are familiar with design patterns and architecture principles as dependency injection and Service Oriented Architecture. Moreover, you apply problem solving patterns such as reliable messaging and improve the scalability and reliability of the FRISS platform.  </p> <ul> <li>You have worked for at least three to five years as a .NET Developer</li> <li>Main languages are C# and JavaScript, so we expect proficiency in both</li> <li>Knowledge of HTML5 and CSS3</li> <li>Capable of reading user stories and functional requirements and translating them into technical solutions</li> <li>Experience with database programming is mandatory, preferably Microsoft SQL Server</li> <li>Eye for quality and details, even in a fast-paced environment</li> <li>You master English on a business proficiency level</li> <li>You are eager and ambitious.</li> <li>Als u Nederlands beheerst, is dat een pre.</li> </ul><p>Because of the high interest we received (thank you!) we have a couple of <strong>nice</strong>-<strong>to</strong>-<strong>have </strong>experiences as well:</p> <ul> <li>Microservices</li> <li>Azure</li> <li>Continuous integration and delivery (Jenkins, Teamcity, etc.)</li> <li>SSO, OpenID, Elasticsearch, Fiddler.</li> </ul><p>When this fits you like a glove, give us your call, we’re interested in you!<br><br><strong>Our company</strong><br><strong>FRISS </strong>(<a href="https://ltpx.nl/1TS58fr" target="_blank"><strong>friss.eu</strong></a>) offers a ready-to-use business solution for fraud detection, risk management and compliance for non-life insurers. We are European market leader and expanding rapidly in other territories.<br><br> FRISS is a Utrecht based, 130+ people company with branch offices in Germany, Greece, Turkey and Chicago (US). We reside in <strong>Creative Valley</strong>, an inspiring and award winning working environment full of innovation. Our business success has got everything to do with our business culture. Our core values are: We Care And Drive, which means we are people who are enterprising, driven, self-conscious, positive and social. <br><br><strong>Feel we are talking to you? </strong><br> If you're interested, we ask you to participate in our <strong>HackerRank pre</strong>-<strong>screening test</strong>. You can reach this by clicking this link: <strong><a href="http://hr.gs/friss-dev-test" target="_blank"></a><a href="http://hr.gs/friss-dev-test">http://hr.gs/friss-dev-test</a> </strong>and apply via the <a href="https://ltpx.nl/2IYq3K9" target="_blank"><strong>application form</strong></a>.<br><br><em>Don’t worry, we hate automated programming tests too, so we made this one very short and simple, and increased the available time so you can comfortably think, type and debug. Good Luck!</em><br><br> Let us know you're participating by sending your resume with a short letter of motivation by using the application button! We will screen your credentials when you've passed our HackerRank test. <br><br> We will close the application period by the <strong>end </strong>of <strong>September 2018</strong>. Part of our selection process is a pre-employment screening.<br><br><em>Canvassing in respons to this vacancy is not appreciated</em>.<img alt="" src="https://bcontrol.brockmeyer.nl/track.php?orderid=53971"></p>",
how_to_apply: "<p><a href="https://ltpx.nl/7WUuV4n" target="_self">Click here to apply</a></p>",
company: "FRISS",
company_url: "https://www.friss.com/",
company_logo: "http://github-jobs.s3.amazonaws.com/03ae6806-af5f-11e8-8a66-0c4dcdae8d73.jpg",
url: "http://jobs.github.com/positions/1fce6c70-af5f-11e8-9feb-2087c445908f"
},
{
id: "6479094a-af58-11e8-8918-e127b7fcf14d",
created_at: "Mon Sep 03 09:05:50 UTC 2018",
title: "Senior Backend Developer (PHP)",
location: "Rotterdam",
type: "Full Time",
description: "<p><i>You are a technically curious Backend PHP Developer who wants to be part of a core development product team. Do you understand (and maybe even already have experience with) the power of things like TDD, DDD and CQRS? Then apply for the position of Senior Backend Developer (PHP) at VONQ and be part of our team that builds our flagship product, tools and APIs that serve global customers!</i></p> <p><b>Senior Backend Developer (PHP)</b><br><i>Rotterdam, fulltime position (32 - 40), starting ASAP</i></p> <p><b>Lead critical product development efforts and get your hands dirty in the implementation of various applications/services!</b><br> You will be contributing to our flagship product called Job Marketing Platform (JMP). It’s a (big) data-driven application with a recommendation engine to help recruiters market jobs online. JMP incorporates the team’s learnings and best practices including CQRS and event sourcing. The product is used everyday by our customers and we have an ambitious roadmap to build it out to out further!</p> <p>You'll be part of a dedicated engineering team, consisting of 15 (soon more!) engineers, and you’ll work closely with our CTO and our product development team.</p> <p><b>What you actually will do</b><br></p> <ul> <li>Work in an agile (scrum) environment and deliver high quality applications/services<br> </li> <li>Write robust and efficient code primarily using PHP, Symfony and MySQL, and learn other languages/frameworks if needed<br> </li> <li>Pro-actively lead development efforts for new product initiatives and feature development<br> </li> <li>Implement &amp; improve devops practices in your team such as CI, CD, and automated release management<br> </li> <li>Mentor and support team members<br> </li> </ul><p><b>What we need</b><br><i>This describes the ideal candidate, but above all we value people that are eager to grow, • autonomous, work together, and love to get things done!</i><br></p> <ul> <li>5+ years relevant experience in PHP backend engineering for high quality multi-tiered applications.<br> </li> <li>Experience in working in a software team with Agile methodologies (Scrum / Kanban)<br> </li> <li>Excellent communication skills in English<br> </li> <li>Experience in driving architecture, technology and team improvements while delivering new business value and features.<br> </li> <li>Experience with practices such as Domain driven design, TDD, CI and CD<br> </li> </ul><p><b>Bonus points for:</b><br></p> <ul> <li>Experience with devops and infrastructure practices and technology like CI, deployment automation, provisioning, Amazon AWS<br> </li> <li>Experience with event sourcing and CQRS<br> </li> <li>Experience with REST API design<br> </li> </ul><p><b>What’s in it for you</b><br> First of all, you’ll be working with experienced colleagues with a strong vision on web development and software architecture, giving you a full intellectual challenge every day. Secondly you will be part of a vibrant and ambitious team of different nationalities in a very casual environment. Thirdly, you'll have the opportunity to develop yourself everyday, and participate in meetups/conferences.</p> <p>We often have a BBQ (and beers) on our terrace at the office and multicultural potluck lunches. Oh.. and you will have fun!</p> <p><b>And there is more! We offer great things, such as:</b><br></p> <ul> <li>Laptop of your preferences and two extra screens on your desk<br> </li> <li>Flexible working hours<br> </li> <li>Unlimited holiday’s<br> </li> <li>Good salary and additional incentives<br> </li> <li>Commuting expenses compensation<br> </li> <li>Time and budget for training<br> </li> <li>Fixed term contract with an option for perm<br> </li> <li>Plenty of whiteboards and sticky notes in our office!<br> </li> </ul><p><b>So, does this sounds appealing to you?</b> Apply by clicking on <a href="https://vonq.redirect.your-jobresponse.com/senior_backend_developer_php_rotterdam/191221/V819/apply">this link</a>. Questions? Get in touch with Sarah (Recruiter) -&gt; sarahellithy(at)vonq.com.</p>",
how_to_apply: "<p><a href="https://vonq.redirect.your-jobresponse.com/senior_backend_developer_php_rotterdam/191221/V819/apply">click here for the application form!</a></p>",
company: "Vonq",
company_url: null,
company_logo: "http://github-jobs.s3.amazonaws.com/3ec11f1c-af58-11e8-8c9d-4815176e5bdb.jpeg",
url: "http://jobs.github.com/positions/6479094a-af58-11e8-8918-e127b7fcf14d"
},
{
id: "1e49ff46-ad24-11e8-9a40-9c1763255d79",
created_at: "Fri Aug 31 13:46:31 UTC 2018",
title: "Software Engineer",
location: "Greater Chicagoland Area",
type: "Full Time",
description: "<p>Buehler, a division of Illinois Tool Works, is a leading manufacturer of scientific equipment and supplies for use in material analysis. Over the past 80 years, Buehler has established sales, manufacturing and laboratory services located throughout North America, Europe and Asia. Comprised of world-class products and brands, Buehler continues a long history of providing market-leading technology to support our customers in their sample preparation and material analysis applications. </p> <p>Celebrating its 100-year anniversary in 2012, ITW is a global diversified industrial manufacturer of value-added consumables and specialty equipment with related service businesses. The Company focuses on profitable growth with strong returns across worldwide platforms and businesses. The businesses serve local customers and markets around the globe, with a significant presence in developed as well as emerging markets.</p> <p>This key position provides Buehler with the ability to design, develop, maintain, and test Windows software which connects to and controls laboratory instrumentation machines. This position will involve daily local and international interaction with software, electrical, and mechanical engineers to develop top notch software and equipment.</p> <p>Job Responsibilities:</p> <ul> <li>Design, develop, and test software in Visual Studio for Windows environments.</li> <li>Creatively implement user stories to provide customers a great user experience.</li> <li>Exercise best practices and methodologies for software development.</li> <li>Support existing software by developing new features (60%), fixing bugs (20%), cleaning up code (10%), and supporting manufacturing (10%). </li> <li>Debug complex application problems and produce quality software documentation and unit test plans.</li> <li>Occasionally work directly with customers to troubleshoot, reproduce, and fix bugs.</li> </ul><p>Required Skills:</p> <ul> <li>Must have an aptitude for software, a drive to produce an amazing product, and the ability to work well with others as well as independently.</li> <li>Proven software development expertise in C# and WPF. </li> <li>Intuitive GUI design experience and strong attention to detail.</li> <li>Familiarity with communication device drivers.</li> <li>Proficient in the use of compilers, debuggers, and other software development tools.</li> <li>Exceptional structured code writer.</li> <li>Strong written and verbal communication skills.</li> <li>Proficient problem solver.</li> <li>Experience in image processing and OpenCV.</li> <li>Experience with serial communications (RS232, RS422/485) and Ethernet</li> <li>SQL Server / database experience</li> <li>Experience with creating installers for Windows environment.</li> <li>DevExpress experience</li> </ul><p>Additional Preferred Skills:</p> <ul> <li>USB driver experience</li> <li>TFS, Git, or another repository experience</li> <li>Familiarity with Agile and SCRUM methodologies</li> <li>A nerd-like interest in metallurgy or material science will help.</li> <li>Ability to banter with our Linux developers about operating system superiority is a plus.</li> <li>Sprechen Sie Deutsch? Das ist sehr gut.</li> <li>Bonus points for familiarity with Linux, Qt, and Windows App Store.</li> </ul><p>Education / Experience Required:</p> <ul> <li>BS degree (or equivalent experience) in engineering, computer science, or related field.</li> <li>The ideal candidate will have recent experience in developing GUI software for Windows.</li> </ul><p>Company Perks:</p> <ul> <li>401k with match, health and dental insurance</li> <li>Great HR department that organizes (food trucks, ice cream trucks, summer bags &amp; volleyball tournaments, ping-pong, and company sponsored volunteer days)</li> <li>Training and conferences to keep you on the bleeding edge of your discipline</li> <li>Catered breakfast on code review days</li> <li>Monthly software team lunches</li> <li>Casual Fridays</li> <li>Corporate discount program offering discounts and free museum passes</li> </ul>",
how_to_apply: "<p>Visit our career website at: <a href="http://itwbuehler.balancetrak.com/">http://itwbuehler.balancetrak.com/</a> and navigate to requisition number 2019-029</p>",
company: "Buehler",
company_url: null,
company_logo: "http://github-jobs.s3.amazonaws.com/0e26836e-ad24-11e8-9d3b-309fc210919f.JPG",
url: "http://jobs.github.com/positions/1e49ff46-ad24-11e8-9a40-9c1763255d79"
},
{
id: "8191ffc2-ad1a-11e8-9ff1-70ce9cda5e46",
created_at: "Fri Aug 31 12:37:42 UTC 2018",
title: "(Fullstack-)Entwickler (m/w)",
location: "Düsseldorf",
type: "Full Time",
description: "<p><b>(Fullstack-)Entwickler (w/m)</b><br> Festanstellung in Vollzeit (40 Stunden)</p> <p><b>Das bringst Du mit</b><br></p> <ul> <li>Erfolgreich abgeschlossenes Studium der Informatik oder Wirtschaftsinformatik, oder eine vergleichbare Ausbildung oder eine gleichwertige Erfahrung<br> </li> <li>Erfahrung in mindestens zwei Programmiersprachen (insbesondere Ruby, Javascript, und PHP)<br> </li> <li>Erfahrung mit HTML/CSS<br> </li> <li>Offenheit für Neues und der Wunsch zu lernen, z.B. neue Sprachen und Systeme zu lernen<br> </li> <li>Begeisterungsfähigkeit und ein freundliches Auftreten<br> </li> <li>Github-Profil ist von Vorteil<br> </li> <li>Gute Englisch- und Deutschkenntnisse (unsere Code-Kommentare und Dokumentationen sind in Englisch, im Büro sprechen wir Deutsch)<br> </li> </ul><p><b>Das erwartet Dich</b><br> Als Entwickler arbeitest Du mit Marc (CTO), Christian (Backoffice IT/Entwickler), Katja (Designer/HTML/CSS) und Fatih (Studentische Hilfskraft) zusammen. Deine Aufgabe wird es sein, unsere bestehenden Systeme zu verbessern und neue Systeme zu erstellen, um die Geschäftsanforderungen zu erfüllen. Bei uns kannst Du von einem erfahrenen CTO lernen und Dich in verschiedenste Technologien einarbeiten. Die Bereitschaft zu lernen, ist für uns eines der wichtigsten Kriterien. Wir müssen nicht ständig auf die neueste Technologie aufspringen, aber wir sind immer daran interessiert, neue Dinge auszuprobieren, um unsere Arbeit besser zu machen.</p> <p>Unser aktueller Tech Stack ist:</p> <ul> <li>ReactJS<br> </li> <li>VueJS<br> </li> <li>jQuery<br> </li> <li>PHP<br> </li> <li>Ruby on Rails<br> </li> <li>Docker<br> </li> <li>Vagrant<br> </li> </ul><p>Mit Deinen Ideen und Deinem Tatendrang unterstützt Du die Erweiterung und Modernisierung unserer firmeneigenen Webanwendungen. Einmal im Monat treffen wir uns standortübergreifend zu einem Ideenmeeting, in dem Du dich aktiv einbringst, um unser Nischenprodukt verantwortungs- und qualitätsbewusst mit neuen Ansätzen voranzubringen.</p> <p><b>Das bieten wir Dir</b><br></p> <ul> <li>Freie Technikwahl<br> </li> <li>Selbstständiges Arbeiten in einem agilen Entwicklungsteam mit flachen Hierarchien und kurzen Entscheidungswegen<br> </li> <li>Zukunftssicherer Arbeitsplatz, leistungsgerechte Vergütung und in Absprache flexible Arbeitszeiten<br> </li> <li>Aktive Mitgestaltung und Verwirklichung eigener Ideen<br> </li> <li>Freie Getränke, frisches Obst<br> </li> <li>Große Terrasse, Grill, Feierabendbier<br> </li> <li>Attraktive Standorte in zentraler Lage mit guter Verkehrsanbindung<br> </li> </ul><p><b>Das sind wir</b><br> kautionsfrei.de ist ein 2008 gegründetes Unternehmen mit Standorten in Düsseldorf und Berlin, das auf Mietkautionsbürgschaften spezialisiert ist und zu den Marktführern in Deutschland zählt. Aus anfänglich wenigen Leuten und einer großen Idee ist ein starkes Unternehmen mit kreativen und internetaffinen Köpfen geworden, das großen Wert auf die Bündelung von Inhouse-Kompetenzen legt. Ernährer und Basis unseres Erfolges ist kautionsfrei.de. Unsere Wachstumsstrategie: Neue Produkte nur bei Bedarf und wenn wir alle Bock drauf haben.</p> <p><b>Dafür stehen wir</b><br></p> <ul> <li>Kleines, inhabergeführtes Unternehmen<br> </li> <li>sichere Arbeitsplätze mit Raum für Entwicklung und Verantwortung<br> </li> <li>Transparenz, Flexibilität, Spaß an Produkt und Arbeit<br> </li> </ul><p><b>Das spricht Dich an?</b><br> Dann bewirb Dich jetzt als „Developer (m/w)“ unter Angabe Deiner frühestmöglichen Verfügbarkeit und Deiner Gehaltsvorstellung über einen Klick auf diesen <a href="https://kautionsfrei.hat-stellen.de/fullstack_entwickler_m_w_duesseldorf/57bf58a3-f840-4b3b-8bef-f31a714baabd/apply?channelId=V819">Link</a></p> <p>Bitte beantworte die folgenden Fragen in Deiner Bewerbung: A) Sag uns so detailliert wie möglich, was passiert, wenn Du den Web-Browser öffnest und google.com in das Adressfeld eingibst. B) Erzähl uns in einigen kurzen Abschnitten von Deinem schwersten IT-Problem und was Du getan hast, um es zu lösen. C) Erzähl von Deinem Lieblingsfilm und was ihn für Dich besonders macht?</p> <p>Bei Fragen und für einen ersten persönlichen Kontakt steht Dir Marc Runkel unter +49 211 54268314 zur Verfügung.</p> <p>kautionsfrei.de │ Talstraße 24 │ 40217 Düsseldorf kautionsfrei.de │ Gaudystr. 26 │ 10437 Berlin</p>",
how_to_apply: "<p><a href="https://kautionsfrei.hat-stellen.de/fullstack_entwickler_m_w_duesseldorf/57bf58a3-f840-4b3b-8bef-f31a714baabd/apply?channelId=V819">Bewirb dich jetzt hier!</a></p>",
company: "kautionsfrei.de",
company_url: "http://www.kautionsfrei.de",
company_logo: "http://github-jobs.s3.amazonaws.com/7bfbab80-ad1a-11e8-96f2-fd740ad9fb0b.png",
url: "http://jobs.github.com/positions/8191ffc2-ad1a-11e8-9ff1-70ce9cda5e46"
},
{
id: "b1e189d4-ad03-11e8-9bd7-02e464162dec",
created_at: "Fri Aug 31 09:53:41 UTC 2018",
title: "Junior Java Softwareentwickler (m/w)",
location: "München",
type: "Full Time",
description: "<p>Sie suchen eine abwechslungsreiche Tätigkeit als Java Softwareentwickler (m/w) in einem innovativen IT-Umfeld? Sie haben Freude an der Entwicklung moderner Lösungen innerhalb eines motivierten Teams, in dem mit agilen Methoden und aktuellen Technologien (z.B. Docker, Jenkins, Gradle, Flyway, Ansible) gearbeitet wird? Dann sollten wir uns kennenlernen!<br></p> <p>Für unser Team in München suchen wir Sie <b>zum nächstmöglichen Zeitpunkt</b> in <b>unbefristeter Festanstellung</b> als<br></p> <p><b>Junior Java Softwareentwickler (m/w)</b><br></p> <p><b>Ihre Aufgaben als Java Softwareentwickler/in</b><br></p> <ul> <li>Eigenverantwortliche Entwicklung von Software zur Rezeptabrechnung in einem agilen Projektumfeld<br> </li> <li>Analyse und Design der Softwareentwicklung mithilfe von agilen Projektmethoden und Tools (Kanban, CCD) <br> </li> <li>Koordination, Beratung und Abstimmung mit verschiedenen Fachabteilungen<br> </li> </ul><p><b>Ihr Profil als Java Softwareentwickler/in</b><br></p> <ul> <li>Erfolgreich abgeschlossenes Studium der Informatik oder vergleichbare Studienrichtung<br> </li> <li>Kenntnisse in objektorientierter Softwareentwicklung mit Java, Unit-Tests und relationalen Datenbanken<br> </li> <li>Idealerweise Erfahrungen Webtechnologien (JSF, Primefaces) und GIT<br> </li> <li>Analytische Kompetenz, strukturierte und zuverlässige Arbeitsweise sowie Teamfähigkeit<br> </li> </ul><p><b>Unser Angebot an Sie</b><br></p> <ul> <li>Eine abwechslungsreiche Tätigkeit als Java Softwareentwickler/in in einem innovativen IT-Umfeld, in dem mit agilen Methoden und moderner Technik gearbeitet wird<br> </li> <li>Attraktive Vergütung inklusive umfassender Sozialleistungen<br> </li> <li>Vielfältiges Entwicklungs- und Schulungsprogramm mit individuellen Weiterbildungsangeboten<br> </li> <li>Gelebte Work-Life-Balance durch flexible Arbeitszeitmodelle und 30 Tage Urlaub im Jahr<br> </li> <li>Die Möglichkeit ein Dienstfahrrad zu leasen, das Sie auch privat nutzen können<br> </li> <li>Sport- und Freizeitangebote im Rahmen unseres Gesundheitszirkels<br> </li> </ul><p><b>Über die NOVENTI HealthCare GmbH</b><br> Die NOVENTI HealthCare ist mit ihren über 1.000 Mitarbeitern, bundesweit mehr als 33.000 Kunden und einem jährlichen Abrechnungsvolumen von 19 Mrd. Euro nationaler Marktführer im Gesundheitswesen für den Bereich Abrechnung von Apotheken und Sonstige Leistungserbringer. Durch den Fokus auf innovative Weiterentwicklung gestaltet die NOVENTI HealthCare GmbH als von der BAFIN autorisiertes Finanzdienstleistungsinstitut aktiv die Prozesse und Standards für den deutschen Gesundheitsmarkt.<br></p> <p><b>Sie möchten auf dem schnellsten Weg zu uns? <br> Jetzt bewerben über den Bewerbungsformular !</b><br></p> <p><a href="https://vsa.redirect.your-jobresponse.com/junior_java_softwareentwickler_m_w_muenchen/224911/V819/anwenden">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p> <p>Alle weiteren Informationen finden Sie unter<br><a href="https://noventi-healthcare-karriere.dvinci-easy.com/de/jobs/6/intro">Junior Java Softwareentwickler </a></p>",
how_to_apply: "<p><a href="https://vsa.redirect.your-jobresponse.com/junior_java_softwareentwickler_m_w_muenchen/224911/V819/anwenden">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a></p>",
company: "NOVENTI HealthCare GmbH",
company_url: "https://www.noventi.healthcare/",
company_logo: "http://github-jobs.s3.amazonaws.com/9f770224-ad03-11e8-8871-8562a7abdf9d.jpg",
url: "http://jobs.github.com/positions/b1e189d4-ad03-11e8-9bd7-02e464162dec"
},
{
id: "46387aa6-ac8d-11e8-8e87-91acb196a67c",
created_at: "Thu Aug 30 19:46:36 UTC 2018",
title: "FPGA Engineer",
location: "Austin, Texas",
type: "Full Time",
description: "<p>Thorlabs Scientific Imaging group in Austin, Texas designs and manufactures state-of-the-art digital cameras and imaging systems. We are seeking a talented, experienced FPGA design and verification engineer to lead the development and commercialization of a FPGA-based, high-speed, data acquisition host adapters for Thorlabs products.</p> <p>Essential Job Functions include the following, but are not limited to:</p> <p>Technology transfer from Thorlabs R&amp;D division Participation in building core technical team Working with internal customers to finalize product requirements Development of Field Programmable Gate Arrays including coding, test and functional verification, timing closure, and documentation. Emphasis on timing closure and high-speed hardware data paths. Qualifications</p> <p>Experience:</p> <p>Minimum 5 years of FPGA design experience with 2 years of board-level product commercialization experience Education:</p> <p>Minimum Bachelor's degree or equivalent in Electrical Engineering Specialized Knowledge and Skills:</p> <p>Demonstrated strong VHDL and/or Verilog skills; logical and physical design, timing closure Recent design of complex, dense design with Xilinx FPGA design flow and simulation tools High-speed (GHz) serial and DDR3 implementations Familiarity with high-speed (GHz) PCB design techniques Recent design of data-intensive architectures and functional blocks; for example RADAR, LIDAR, or HDTV. FPGA-based, board-level architecture and design Demonstrated ability to bring FPGA subsystem from concept through release to manufacturing Working knowledge of signal processing algorithms, host architectures, and host data storage devices and optimization techniques Contribute to the development of project timelines and milestones Assess FPGA technical risk; including analysis, simulation, prototyping, and contingency planning Design for Test and Manufacturability Board-level, production test development and implementation Electronic device commercialization PCIe Host Adaptor Card design and commercialization experience desired Imaging Systems experience desired Digital Signal Processing experience desired</p> <p>Thorlabs values its diverse environment and is proud to be an Equal Employment Opportunity/Affirmative Action employer. All qualified individuals will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age or veteran status. Job descriptions are not intended as and do not create employment contracts. The organization maintains its status as an at-will employer. Employees can be terminated for any reason not prohibited by law.</p>",
how_to_apply: "<p>Please be sure to complete an application on the company's career site for consideration: <a href="https://www.appone.com/MainInfoReq.asp?R_ID=2125923">https://www.appone.com/MainInfoReq.asp?R_ID=2125923</a></p>",
company: "Thorlabs, Inc.",
company_url: "https://www.thorlabs.com/CareersByCountry.cfm#/",
company_logo: "http://github-jobs.s3.amazonaws.com/433dda4e-ac8d-11e8-9f1c-7cf0f2f4ccf2.jpg",
url: "http://jobs.github.com/positions/46387aa6-ac8d-11e8-8e87-91acb196a67c"
},
{
id: "7da584a0-ac71-11e8-9112-3a28a4cdb5f8",
created_at: "Thu Aug 30 18:36:42 UTC 2018",
title: "Java Software Engineering Manager ($100K/yr)",
location: "Remote work",
type: "Full Time",
description: "<p>We're running an Online Hiring Event this coming Saturday to hire Java Software Engineering Managers ($100K/yr).</p> <p>Online Hiring Events are live forums designed to enable you to understand the role and requirements through an interactive Q&amp;A session followed by a self-directed testing process. The testing takes between 3-5 hours to complete. It’s worth taking the time to finish all the tests because we evaluate every single complete application to find the top talent.</p> <p>This event will include all testing required to apply for the role. Upon grading the tests, and if you advance, we will set up an interview with the hiring manager.</p> <p>The Software Engineering Manager will serve as a key member of the global executive team for Aurea or one of its affiliated sister companies and will be responsible for quarterly high-quality product delivery.</p> <p>As part of the leadership team, you will be expected to run an engineering organization using a revolutionary and radically differentiated process. With a focus on small, great global teams, productivity, factory-like process, and quantifiable business impact, you will be expected to drive higher levels of value and productivity from your engineering organization than most companies would expect to achieve.</p> <p>You must build, develop and engage a team from a global talent pool. In doing so, you must set an agenda for the function where the teams effectively and efficiently solve some of the most challenging software problems with engineers distributed around the globe.</p> <p>You will leverage your personal technical depth as a former developer and architect in order to set a personal standard for software engineering excellence, to push your teams and to assess the talent base you need to maintain.</p> <p><strong>Candidate Requirements:</strong></p> <ul> <li>Bachelor’s Degree in Computer Science (MS or Ph.D. preferred) is absolutely mandatory.</li> <li>10+ years of engineering experience leading multiple teams across multiple products and technologies — this is a global leadership role for a seasoned software development leader, not a first executive role for a great software development manager</li> <li>Proven managerial skills with at least 3 years of experience managing teams of at least 10 heads</li> <li>At least 3 years of experience working in Cloud, Agile, CI/CD, DevOps environments. We live in the Cloud.</li> <li>Experience in Software Engineering focused instead of product management</li> <li>Proven experience in building high-performance teams and scalable best engineering practices</li> <li>Hands-on experience in Java / C++ / C#(.Net) / Python / PHP / Ruby on Rails architecture and programming and some front-end Javascript framework in a development-intensive individual contributor role</li> <li>Excellent understanding of current enterprise software technologies and development practices/tools, including virtualization, source control, build and test automation, code quality automation technologies</li> <li>Experience with high-end enterprise systems deployed in environments of Global 100 corporation complexity</li> <li>Proficiency in Test Automation, AWS and TDD is desired but not mandatory</li> <li>Demonstrated success as a problem solver, result-oriented, self-starter</li> <li>Comfortable “working virtually” with teammates and customers around the world. We do a lot of Skype and video conferencing</li> <li>Good proficiency in the English language</li> </ul>",
how_to_apply: "<p>Register here: <a href="https://javasoftwareengineeringmanager.eventbrite.com/?aff=funJosGithub">https://javasoftwareengineeringmanager.eventbrite.com/?aff=funJosGithub</a></p>",
company: "Crossover",
company_url: "http://www.crossover.com",
company_logo: "http://github-jobs.s3.amazonaws.com/73f66f96-ac71-11e8-8dbc-7731070d5652.png",
url: "http://jobs.github.com/positions/7da584a0-ac71-11e8-9112-3a28a4cdb5f8"
},
{
id: "83ed3222-ac71-11e8-8b74-2f5a0281e351",
created_at: "Thu Aug 30 18:36:42 UTC 2018",
title: "Java Software Architect ($60K/yr)",
location: "Remote work",
type: "Full Time",
description: "<p>We're running an Online Hiring Event this coming Saturday to hire Java Software Architects ($60K/yr).</p> <p>Online Hiring Events are live forums designed to enable you to understand the role and requirements through an interactive Q&amp;A session followed by a self-directed testing process. The testing takes between 3-5 hours to complete. It’s worth taking the time to finish all the tests because we evaluate every single complete application to find the top talent.</p> <p>This event will include all testing required to apply for the role. Upon grading the tests, and if you advance, we will set up an interview with the hiring manager.</p> <p>As a Software Architect, you will be part of a team responsible for ensuring that customers are blown away by the technical differentiation and quality of the product. We want to give you the ability to look at code in ways it has never been looked at before, to understand the interdependency in the code.</p> <p>We are empowering software development and creating higher quality code by using the latest technologies and toolsets. We are excited about using data to make decisions, we are bringing big data and analysis to software development.</p> <p>We are on the cutting edge of software development, and we innovate improvements on the newest technologies. We want people who are adaptable and can learn new things and can use new ideas and concepts to solve business problems.</p> <p><strong>Expectations:</strong></p> <ul> <li>Develop expertise in one or more of our proprietary enterprise software products.</li> <li>Leverage your broad technology capabilities and maintain a level of excitement in using various technologies to architect, develop, and iteratively deploy real enterprise class software.</li> </ul><p><strong>Candidate Requirements:</strong></p> <ul> <li>Bachelor’s Degree in Computer Science, Electrical Engineering, or Computer Engineering</li> <li>5+ years of experience as both a hands-on architect and a software engineer</li> <li>At least 4 years experience in a CICD environment</li> <li>Have a minimum of 2 years experience leading or mentoring other more junior developers</li> <li>5+ years experience in writing unit tests</li> <li>Leadership experience in creating, deploying, and iterating excellent software</li> <li>Proficiency in the following skills and technologies is mandatory:</li> <li>Programming Language (Java / C++ / C#(.Net) / PHP / Python / Ruby on Rails)</li> <li>Database(SQL server/Oracle/MySQL/MongoDB/Cassandra)</li> <li>SOA, EDA, and Design patterns</li> <li>Javascript (ReactJS, AngularJS), HTML5, CSS3</li> <li>Cloud computing architecting</li> <li>Linux, Django, REST, tools for CI/CD (Jenkins), Git, and shell scripting</li> <li>DevOps</li> <li>Writing Unit Test Cases</li> <li>MVC and knowledge of another server-side programming language are desired but not mandatory</li> <li>Demonstrate success as a problem solver, result-oriented, and a self-starter</li> <li>Comfortable “working virtually” with teammates and customers around the world. We do a lot of Skype and video conferencing</li> <li>Good proficiency in the English language</li> </ul><p><strong>Bootcamp Program:</strong></p> <p>As a candidate for this position, you are invited to take part in a paid training program led by our best-in-class teams, on best-in-class technologies in our 4-week Bootcamp program.</p> <p>After grading your tests, you will be eligible to take the Bootcamp which is usually held within a week of obtaining your test results. You will be paid the full-time rate for 40 hours per week for four weeks.</p> <p>Once the Bootcamp tests are complete, we will be able to evaluate you for the position correctly. Taking the Bootcamp doesn’t guarantee that you will be hired, but you will learn everything you'll need to be successful in the role as part of the hiring process.</p>",
how_to_apply: "<p>Register here: <a href="https://javasoftwarearchitect.eventbrite.com/?aff=funJosGithub">https://javasoftwarearchitect.eventbrite.com/?aff=funJosGithub</a></p>",
company: "Crossover",
company_url: "http://www.crossover.com",
company_logo: "http://github-jobs.s3.amazonaws.com/564def46-ac71-11e8-9949-bedc7c60c9a9.png",
url: "http://jobs.github.com/positions/83ed3222-ac71-11e8-8b74-2f5a0281e351"
},
{
id: "2a687580-ac77-11e8-8cbd-97e4c63b3a58",
created_at: "Thu Aug 30 17:07:40 UTC 2018",
title: "Senior Software Engineer",
location: "Overland Park, KS",
type: "Full Time",
description: "<p>Onspring is seeking an experienced software engineer with a passion for stunning application design and product development. The ideal candidate will be a wizard at MVC / .NET and have a strong appreciation for current and emerging standards. Onspring is intensely focused on UI/UX and performance, and all members of our Development team must share this passion.</p> <p>Required Experience:</p> <ul> <li>C#</li> <li>MVC</li> <li>Any Javascript Framework (jQuery, Angular, etc.)</li> </ul><p>Desired Experience:</p> <ul> <li>jQuery</li> <li>Kendo</li> <li>FusionCharts</li> </ul><p>Also Preferred:</p> <ul> <li>IIS Management</li> <li>Octopus</li> <li>Linux / Unix</li> <li>NoSQL (Mongo / Elastic / Couchbase / Redis / etc.)</li> </ul><p>About Onspring: <a href="https://www.onspring.com">Onspring</a> was founded in 2010 with a simple idea: To empower business people to innovate and solve problems for themselves. Our <a href="https://www.onspring.com/platform/">No-Code Platform</a> for process automation, workflow, collaboration and reporting is used by some of the largest and most forward-thinking companies in the world. We maintain a dynamic, lively workplace and encourage our team members to share ideas, challenge conventional wisdom and have fun along the way.</p> <p>Some of the reasons you’ll enjoy working at Onspring:</p> <ul> <li>Amazing co-workers</li> <li>Cutting-edge technologies</li> <li>Family-first atmosphere (aka: flexibility)</li> <li>Rapid growth</li> <li>Unbounded opportunity</li> </ul>",
how_to_apply: "<p>Email a link to <a href="mailto:jobs@onspring.com">jobs@onspring.com</a> with either your github profile or LinkedIn profile. Include relevant contact information and a brief description as to why you would be a great fit.</p>",
company: "Onspring Technologies",
company_url: "https://www.onspring.com",
company_logo: "http://github-jobs.s3.amazonaws.com/0dcb70f8-ac77-11e8-826c-f81e1c30f3e5.png",
url: "http://jobs.github.com/positions/2a687580-ac77-11e8-8cbd-97e4c63b3a58"
},
{
id: "b2bab618-ac73-11e8-9bf0-89a2dc683a65",
created_at: "Thu Aug 30 16:43:02 UTC 2018",
title: "Web and Multimedia Developer",
location: "Darmstadt",
type: "Full Time",
description: "<p>Develop our website to show the world that EUMETSAT forecasts more than just the weather.</p> <p>With more than 700,000 visits each year to our website from 202 countries using 317 languages, we are looking for an experienced developer to interactively showcase our work to help inform, educate and inspire visitors. The use of technology is critical to our success and we need someone who can visualise our services and products, bringing them to life. </p> <p>Your role at EUMETSAT</p> <p>At EUMETSAT, we have experts monitoring, delivering and interpreting data from our satellites. This information is used to forecast weather, sea temperatures and air quality. Our use of technology is vital to everyday life. You will have the opportunity to use your creativity to exploit our remote sensing products and to develop computer generated visualisations for our website and social media channels.</p> <p>You will need to extensive experience of developing successful websites ideally in a scientific or technical environment. You will maintain and develop interactive content for all our on-line channels reflecting the way our forecasting is developing to suit the needs of our partners and users now and in the future. You will need outstanding interpersonal and communication skills, with the ability to visualise and explain complex information simply. We work in a matrix environment, so you will need to be able to work in multi-disciplinary teams, as well as independently.</p> <p>What we offer</p> <p>We work in a collaborative, international environment which offers you a competitive salary and outstanding benefits. You will work with people who are experts in their field. We value diversity and seek to recruit nationals from our Member States.</p> <p>Does this sound like you?</p> <p>Have a look at our website to find out how you can make a world of difference. The closing date is 16th September. Interviews w/c 1st October.</p>",
how_to_apply: "<p>Apply via: <a href="https://onlineapplication.eumetsat.int">https://onlineapplication.eumetsat.int</a></p>",
company: "EUMETSAT",
company_url: "http://www.eumetsat.int",
company_logo: "http://github-jobs.s3.amazonaws.com/a6a23310-ac73-11e8-9fc1-dc3f5a1f9dbe.jpg",
url: "http://jobs.github.com/positions/b2bab618-ac73-11e8-9bf0-89a2dc683a65"
},
{
id: "48afb5c4-ac56-11e8-90ed-8d5928bf428b",
created_at: "Thu Aug 30 13:12:23 UTC 2018",
title: "Full Stack Developer (m/f)",
location: "Munich, Germany",
type: "Full Time",
description: "<p>We are looking for a full stack developer to join our team in Munich. You’re interested in further optimizing and automating the technical integration of our partner shops and delivering high quality software is your number one priority? Then Stylight is your place to be.</p> <p>Your Team</p> <p>Is responsible for automating and continuously improving the technical integration tools and systems used by our business and finance teams as well as hundreds of business partners. Codes primarily in Python (mostly for backend applications) and Javascript (for interactive UIs) and is committed to the quality and health of their codebase. Works in an agile and cross-functional environment alongside our sales and partner managers Enjoys autonomous work as well as pair programming, code reviews and learning together.</p> <p>Your Responsibilities</p> <p>Build, maintain, and monitor our scalable architecture. We take pride in building highly performant and failure resistant platforms with a small team. Own services from design, development, and testing to continuous integration, monitoring, and user support. Foster technical excellence in the team. Bring your best practices, challenge the status quo, and set things in motion. Enjoy what you do, and be ready to research and learn new technologies. Explain technical topics to non-technical colleagues.</p> <p>Your Profile</p> <p>You bring hands-on experience in software development, ideally 2 years or more. We hope you love Python and Javascript and have experience with it too! If not, we expect you to have a strong desire to learn and significant experience in other programming languages. You want to take responsibility and ownership for the software you produce. “You build it, you run it!” is our general philosophy. You have solid experience with both relational and NoSQL databases. You have proficient English skills and are able to communicate honestly and openly with your colleagues. You’re excited to work in an environment where collaboration, continuous integration and delivery are as vital as morning coffee. Experience with Docker, AWS, and Linux is a very nice plus.</p> <p>Why Join Stylight?</p> <p>Stylight is #1 Meetup organizer in Munich, and deeply involved in the local tech community. We organize daho.am, our own annual developer conference. Top-notch speakers and over 1,000 attendees. International &amp; highly motivated environment with open business culture in all departments. Hands-on work after quick ramp up &amp; openness to new solutions and improvements. A personal development budget is given to you to use throughout the year for personal growth. We have one of the coolest office spaces in Munich (and actually in Germany). Experience Munich: Our office is in the city-center, and just a 10-minute walk to the nearest Biergarten. Want to know more? Check out: about.stylight.com and tech.stylight.com.</p> <p>Up for the Challenge?</p> <p>Then do not hesitate and apply today! We are looking forward to receiving your complete application (CV, cover letter)! Your contact: Carina Meyer.</p>",
how_to_apply: "<p>Please apply here: <a href="https://stylight-jobs.personio.de/job/82960?_pc=6597#apply">https://stylight-jobs.personio.de/job/82960?_pc=6597#apply</a></p>",
company: "Stylight GmbH",
company_url: "http://www.stylight.com",
company_logo: "http://github-jobs.s3.amazonaws.com/404a8ce2-ac56-11e8-8247-7bb5d6bd44a8.jpg",
url: "http://jobs.github.com/positions/48afb5c4-ac56-11e8-90ed-8d5928bf428b"
},
{
id: "9e8ba450-e72e-11e7-926f-6ce07b7015c8",
created_at: "Thu Aug 30 13:09:41 UTC 2018",
title: "Compiler Engineer",
location: "New York & London",
type: "Full Time",
description: "<p>Jane Street is a proprietary quantitative trading firm, focusing primarily on trading equities and equity derivatives. We use innovative technology, a scientific approach, and a deep understanding of markets to stay successful in our highly competitive field. We operate around the clock and around the globe, employing over 500 people in offices in New York, London and Hong Kong.</p> <p>The markets in which we trade change rapidly, but our intellectual approach changes faster still. Every day, we have new problems to solve and new theories to test. Our entrepreneurial culture is driven by our talented team of traders and programmers. At Jane Street, we don't come to work wanting to leave. We come to work excited to test new theories, have thought-provoking discussions, and maybe sneak in a game of ping-pong or two. Keeping our culture casual and our employees happy is of paramount importance to us.</p> <p>As Jane Street grows, the quality of the development tools we use matters more and more. We increasingly work on the OCaml compiler itself: adding useful language features, fine-tuning the type system and improving the performance of the generated code. Alongside this, we also work on the surrounding toolchain, developing new tools for profiling, debugging, documentation and build automation.</p> <p>We're looking to hire a developer with experience working on compilers to join us. That experience might be from working on a production compiler in industry or from working on research compilers in an academic setting. No previous experience with OCaml or functional programming languages is required.</p> <p>We’re looking for candidates for both our London and New York offices. Benefits and compensation are highly competitive.</p>",
how_to_apply: "<p><a href="https://www.janestreet.com/join-jane-street/apply/">https://www.janestreet.com/join-jane-street/apply/</a></p>",
company: "Jane Street",
company_url: "http://Jane Street",
company_logo: "http://github-jobs.s3.amazonaws.com/dba43940-0b39-11e3-83c2-8c287f4c9d67.jpeg",
url: "http://jobs.github.com/positions/9e8ba450-e72e-11e7-926f-6ce07b7015c8"
},
{
id: "0a9333c4-71da-11e0-9ac7-692793c00b45",
created_at: "Thu Aug 30 13:09:15 UTC 2018",
title: "Software Developer (Functional Programming)",
location: "New York, NY; London, UK; Hong Kong",
type: "Full Time",
description: "<p>Software Developer </p> <p>Jane Street is a proprietary quantitative trading firm, focusing primarily on trading equities and equity derivatives. We use innovative technology, a scientific approach, and a deep understanding of markets to stay successful in our highly competitive field. We operate around the clock and around the globe, employing over 500 people in offices in New York, London and Hong Kong.</p> <p>The markets in which we trade change rapidly, but our intellectual approach changes faster still. Every day, we have new problems to solve and new theories to test. Our entrepreneurial culture is driven by our talented team of traders and programmers. At Jane Street, we don't come to work wanting to leave. We come to work excited to test new theories, have thought-provoking discussions, and maybe sneak in a game of ping-pong or two. Keeping our culture casual and our employees happy is of paramount importance to us.</p> <p>We are looking to hire great software developers with an interest in functional programming. OCaml, a statically typed functional programming language with similarities to Haskell, Scheme, Erlang, F# and SML, is our language of choice. We've got the largest team of OCaml developers in any industrial setting, and probably the world's largest OCaml codebase. We use OCaml for running our entire business, supporting everything from research to systems administration to trading systems. If you're interested in seeing how functional programming plays out in the real world, there's no better place.</p> <p>The atmosphere is informal and intellectual. There is a focus on education, and people learn about software and trading, both through formal classes and on the job. The work is challenging, and you get to see the practical impact of your efforts in quick and dramatic terms. Jane Street is also small enough that people have the freedom to get involved in many different areas of the business. Compensation is highly competitive, and there's a lot of room for growth.</p> <p>You can learn more about Jane Street and our technology from our main site, janestreet.com. You can also look at a a talk given at CMU about why Jane Street uses functional programming (<a href="http://ocaml.janestreet.com/?q=node/61">http://ocaml.janestreet.com/?q=node/61</a>), and our programming blog (<a href="http://ocaml.janestreet.com">http://ocaml.janestreet.com</a>).</p> <p>We also have extensive benefits, including:</p> <ul> <li>90% book reimbursement for work-related books</li> <li>90% tuition reimbursement for continuing education</li> <li>Excellent, zero-premium medical and dental insurance</li> <li>Free lunch delivered daily from a selection of restaurants</li> <li>Catered breakfasts and fresh brewed Peet's coffee</li> <li>An on-site, private gym in New York with towel service</li> <li>Kitchens fully stocked with a variety of snack choices</li> <li>Full company 401(k) match up to 6% of salary, vests immediately</li> </ul><p>More information at <a href="http://janestreet.com/culture/benefits/">http://janestreet.com/culture/benefits/</a></p>",
how_to_apply: "<p>Please apply through our web app form at <a href="https://www.janestreet.com/join-jane-street/apply/">https://www.janestreet.com/join-jane-street/apply/</a></p>",
company: "Jane Street",
company_url: "http://janestreet.com",
company_logo: "http://github-jobs.s3.amazonaws.com/dba43940-0b39-11e3-83c2-8c287f4c9d67.jpeg",
url: "http://jobs.github.com/positions/0a9333c4-71da-11e0-9ac7-692793c00b45"
},
{
id: "37508dea-ac55-11e8-9426-bdc0a1566021",
created_at: "Thu Aug 30 13:07:41 UTC 2018",
title: "Software Engineer (m/f)",
location: "Munich, Germany",
type: "Full Time",
description: "<p>For our office in Munich, we are looking for a Software Engineer to help us scale our product enrichment processes while continuing our move to microservices . If you like thinking outside the box and challenging the status quo — this is the place for you!</p> <p>Your Team</p> <p>Continuously looks for ways to improve our current systems and methods as well as striving to find new ones, all while moving to microservices. Is responsible for identifying and enriching every single product on our website — last year alone, we classified over 30 million products! Is cross-functional yet heavily tech-focused. Works in an agile environment applying Scrum to their daily work life.</p> <p>Your Responsibilities</p> <p>Build, maintain, and monitor our scalable architecture. We take pride in building highly performant and failure resistant platforms with a small team. Join us in continuing our quest to break up our monolithic application into microservices. Foster technical excellence in the team. Bring your best practices, challenge the status quo, and set things in motion. Enjoy what you do, and be ready to research and learn new technologies.</p> <p>Your Profile</p> <p>We breathe Python! We hope you do too, if not, it’s enough to have mastered at least one other programming language. You bring hands-on experience in software development, ideally around 2 years. “You build it, you run it!” is your software engineering motto. You’re excited to work in an environment where collaboration, continuous integration and delivery are as vital as morning coffee. You have solid experience with both relational and NoSQL databases. You have strong English communication skills. Experience with Docker, Amazon Web Services, and Linux is a very nice plus.</p> <p>Why join Stylight?</p> <p>Stylight is #1 Meetup organizer in Munich, and deeply involved in the local tech community. We organize daho.am, our own annual developer conference. Top-notch speakers and over 1,000 attendees. International &amp; highly motivated environment with open business culture in all departments. Hands-on work after quick ramp up &amp; openness to new solutions and improvements. A personal development budget is given to you to use throughout the year for personal growth. We have one of the coolest office spaces in Munich (and actually in Germany). Experience Munich: Our office is in the city-center, and just a 10-minute walk to the nearest Biergarten. Want to know more? Check out: about.stylight.com and tech.stylight.com.</p> <p>Up for the Challenge?</p> <p>Then don’t hesitate and apply today! We look forward to your complete application (CV, cover letter)! Your contact: Carina Meyer.</p>",
how_to_apply: "<p>Please apply here: <a href="https://stylight-jobs.personio.de/job/79150?_pc=6597#apply">https://stylight-jobs.personio.de/job/79150?_pc=6597#apply</a></p>",
company: "Stylight GmbH",
company_url: "http://www.stylight.com",
company_logo: "http://github-jobs.s3.amazonaws.com/2e6127a8-ac55-11e8-9b1d-6045fe85d6a7.jpg",
url: "http://jobs.github.com/positions/37508dea-ac55-11e8-9426-bdc0a1566021"
},
{
id: "4568e6c6-abb4-11e8-86c4-846fce2cc4d8",
created_at: "Thu Aug 30 07:33:50 UTC 2018",
title: "Frontend Engineer (Mobile) (M/F/D)",
location: "Berlin",
type: "Full Time",
description: "<p>Wir glauben, dass ein Lächeln die schönste und stärkste Ausdrucksform des Menschen ist. Deshalb wollen wir bei SunshineSmile allen Menschen die Möglichkeit geben, Ihr schönstes Lächeln zu zeigen.</p> <p>SunshineSmile ist eines der schnellst-wachsenden eHealth-Startups in Europa und beschäftigt derzeit ein Team aus 45 hoch talentierten und zufriedenen Mitarbeitern im Herzen Berlins. Wir haben uns auf kosmetische Behandlungen mit proprietären Zahnschienen spezialisiert. Gemeinsam mit unseren Partner-Kieferorthopäden nutzen wir neuste Entwicklungen der 3D-Fertigungstechnik und der Digitalisierung, um Zahnschienenbehandlungen zeit- und geldsparender als je zuvor anzubieten.</p> <p>At SunshineSmile, we believe that a smile is the most powerful form of human expression and communication. Therefore we want to give everyone the chance to show their most beautiful smile by democratizing the access to high-quality dental aligner treatments.</p> <p>SunshineSmile is one of the fastest growing eHealth startups in Europe. We employ around 45 people at our headquarters near Alexanderplatz. We are leveraging digital and mobile communication and 3D manufacturing to revolutionize the way consumers access dental care. Together with our partner-orthodontists, we deliver state-of-the-art dental treatments to our customers.</p> <p><strong>WHAT YOU DO</strong></p> <ul> <li>You work in a cross functional team and define, architect and build new merchant-facing features from concept to launch</li> <li>You ship awesome applications to our customers related to the SunshineSmile experience and digital lifestyle</li> <li>You build the next generation health-tech infrastructure based on modern technologies</li> <li>You are responsible for your production infrastructure and for your code, your build it, you run it, you own it</li> <li>You work in small autonomous teams with short release cycles and increase steadily your workflows</li> <li>You go to Meet-Ups, visit Summits, share your insight with the teams and help to evolve best practice</li> </ul><p><strong>WHO YOU ARE</strong></p> <ul> <li>Javascript-Development ist your Passion (we use React Native)</li> <li>Proficient with one or more of the following: Objective-C, Swift, Java (Android)</li> <li>You have a strong understanding of frontend UI design methodologies to provide our customers the best user experience</li> <li>You like to work in a cross functional team and complete the spirit of team work</li> <li>You enjoy technical discussions, bring your ideas to the team and love to tackle challenges</li> <li>You are resourceful, creative and identify challenges instead of problems</li> <li>You are curious and passionate to extend you horizon, you never stop learning</li> <li>You know, YAGNI, KISS and SOLID aren’t Pokemon’s</li> </ul><p><strong>WHAT WE OFFER</strong></p> <ul> <li>Above-average compensation</li> <li>Flexible working time models</li> <li>Outstanding working atmosphere</li> <li>Flat hierarchies</li> </ul><p><img src="https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4&amp;jid=a1c27ce7-61a9-4c00-a538-ac65b5b34e96&amp;pid=4a060ee7-eef5-4de7-85d0-8e56d6cc02a4&amp;ec=view%3Apixel&amp;cb=https%3A%2F%2Fs3-eu-west-1.amazonaws.com%2Fgohiring-public-assets%2Fpixel.gif" alt="GoHiring"></p>",
how_to_apply: "<p><a href="https://tracking.gohiring.com/c?cid=662c9407-f8cb-4024-a169-90c1c45dcfb4&amp;jid=a1c27ce7-61a9-4c00-a538-ac65b5b34e96&amp;pid=4a060ee7-eef5-4de7-85d0-8e56d6cc02a4&amp;ec=click%3Aapply_url&amp;cb=https%3A%2F%2Fsunshinesmile-gmbh-jobs.personio.de%2Fjob%2F86321%23apply">application form</a></p>",
company: "SunshineSmile GmbH",
company_url: null,
company_logo: "http://github-jobs.s3.amazonaws.com/4232cc1a-abb4-11e8-81ed-e4ef6eee7767.png",
url: "http://jobs.github.com/positions/4568e6c6-abb4-11e8-86c4-846fce2cc4d8"
},
{
id: "d2fc50de-ac01-11e8-8512-9b5a9cc8928f",
created_at: "Thu Aug 30 03:08:17 UTC 2018",
title: "Full Stack Developer",
location: "Ossining, NY",
type: "Full Time",
description: "<p>We are seeking a Full Stack Developer to join our team in developing our web app. This is a full-time, permanent position.</p> <p>Responsibilities Include:</p> <ul> <li>Architect and develop large-scale, well-written single page application</li> <li>Create and maintain existing features by writing quality code that's testable, scalable and secure </li> <li>Migrate Firebase to Firestore and AngularJS 1x to 5</li> <li>Perform code reviews</li> </ul><p>Qualifications:</p> <ul> <li>Deep experience with Google Cloud Services, Kubernetes, KMS, JWT Tokens and App security, Continuous Integration and Deployment</li> <li>Strong ability to develop in JavaScript, NodeJS, AngularJS 1.x-5, Typescript, and Material design</li> <li>Cloud Firestore, Firebase Auth, Security Rules, Cloud Functions</li> </ul><p>Nice to Have:</p> <ul> <li>Electron, Stripe or other billing api</li> </ul>",
how_to_apply: "<p>Email your resume to <a href="mailto:job.position1011@gmail.com">job.position1011@gmail.com</a></p>",
company: "Mindwrapper",
company_url: null,
company_logo: "http://github-jobs.s3.amazonaws.com/2aed4bbe-ac01-11e8-9431-babe5a9c8a17.png",
url: "http://jobs.github.com/positions/d2fc50de-ac01-11e8-8512-9b5a9cc8928f"
},
{
id: "0685ce32-abd8-11e8-831d-8762bfada2ac",
created_at: "Wed Aug 29 22:08:32 UTC 2018",
title: "Scrum Master",
location: "Vienna, Virginia",
type: "Full Time",
description: "<p>At Capital One, we’re building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding. </p> <p>Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good.</p> <p>Scrum Master</p> <p>In the Scrum Master role, you'll ensure your teams’ delivery success by leveraging the appropriate Agile methodology (Scrum/Kanban/etc.) to enable predictable, quality delivery while maintaining a focus on the continuous improvement of the team. The Scrum Master will optimize team productivity by removing impediments that may obstruct the pursuit of the team's goals and by preserving flexibility and ability to rapidly respond to changes on the team.</p> <p>General Responsibilities:</p> <ul> <li>Ensures team(s) maintain focus on quality and continuous delivery</li> <li>Provides visibility into delivery targets, commitments and progress</li> <li>Understands and coaches the team on delivery controls/compliance to minimize operational/reputational risk</li> <li>Understands and supports the product and technical strategies</li> <li>Stays current on domain architecture and targets to identify upstream/downstream dependencies and to support the team in risk management</li> <li>Proactively identifies impediments and appropriately resolves using network of peers and formal channels (including escalation if required)</li> <li>Supports team’s automation (testing, pipelines, deployments)/DevOps journey</li> <li>Integrates Agile &amp; Lean principles into team practices and work products</li> <li>Coaches PO/team on backlog refinement and prioritization</li> <li>Utilizes team feedback and metrics (quality, delivery rate, etc.) to identify areas of opportunity and works with team to continuously improve</li> <li>Innovates with practices and frameworks through experimentation to improve the team and their delivery</li> <li>Understands and encourages team's engineering innovation and improvement (XP engineering practices, Dev Ops, etc.)</li> <li>Coaches the team to improve collaboration and self-organization</li> <li>Acts as an Agile mentor/coach to other Scrum Masters or any Agile role</li> <li>Actively seeks and participates in a variety of learning opportunities such as Communities of Practice, conferences, classroom training and independent study to further develop self and community</li> </ul><p>Basic Qualifications:</p> <ul> <li>Bachelor's Degree</li> <li>At least 2 years of Agile experience</li> </ul><p>Preferred Qualifications:</p> <ul> <li>Certified Scrum Master </li> <li>4+ years of experience facilitating Agile teams on technology projects </li> <li>3+ years of experience using JIRA (or VersionOne)</li> <li>4+ years of experience managing projects </li> <li>3+ years of experience with Enterprise Architecture projects and Open Source activities</li> <li>1+ year of exposure or experience with release train engineering</li> </ul><p>At this time, Capital One will not sponsor a new applicant for employment authorization for this position.</p>",
how_to_apply: "<p>Visit this link to Apply:</p> <p><a href="https://ad.doubleclick.net/ddm/clk/426083498;228187359;y?https://www.capitalonecareers.com/job/vienna/scrum-master/1732/8705499?utm_source=github.com&amp;utm_campaign=ad_hoc_campaigns&amp;utm_medium=job_posting&amp;utm_content=job_board&amp;utm_term=tech_sanfrancisco&amp;ss=paid">https://ad.doubleclick.net/ddm/clk/426083498;228187359;y?https://www.capitalonecareers.com/job/vienna/scrum-master/1732/8705499?utm_source=github.com&amp;utm_campaign=ad_hoc_campaigns&amp;utm_medium=job_posting&amp;utm_content=job_board&amp;utm_term=tech_sanfrancisco&amp;ss=paid</a></p>",
company: "Capital One",
company_url: "https://www.capitalonecareers.com/",
company_logo: "http://github-jobs.s3.amazonaws.com/fd5c3c74-abd7-11e8-8db7-6d636aa991df.png",
url: "http://jobs.github.com/positions/0685ce32-abd8-11e8-831d-8762bfada2ac"
}
]